{
  "WorkItem": {
    "AffectedComponent": {
      "Name": "DataGrid",
      "DisplayName": "DataGrid"
    },
    "ClosedComment": "",
    "ClosedDate": null,
    "CommentCount": 0,
    "Custom": null,
    "Description": "If the contents of a data grid row header change size, only the headers for the currently visible row will be resized.\n \nTo see why this is a problem, consider the following sequence of events:\n \n1) The content of one row header changes, based on a style trigger, causing it's width to increase.\n2) All visible rows have their row header width automatically increased to the width of the modified row (which makes sense)\n3) The user scrolls the grid down to reveal one row that was not previously visible\n \nWhen this happens, the newly visible row will have a row header using the \"default width\". This will be different from every other row, which will have an expanded width.\n \nThe result is a grid that looks horrible.\n \nAlso, there are other problems. If the content of the row header than changes again (because the conditions of the style trigger no longer apply), the width of the row headers will not shrink back to the normal size.\nThat behavior makes no sense.",
    "LastUpdatedDate": "2013-02-21T18:41:32.897-08:00",
    "PlannedForRelease": "",
    "ReleaseVisibleToPublic": false,
    "Priority": {
      "Name": "Low",
      "Severity": 50,
      "Id": 1
    },
    "ProjectName": "wpf",
    "ReportedDate": "2009-02-12T17:25:59.913-08:00",
    "Status": {
      "Name": "Active",
      "Id": 2
    },
    "ReasonClosed": {
      "Name": "Unassigned"
    },
    "Summary": "DataGrid row headers do not resize correctly",
    "Type": {
      "Name": "Issue",
      "Id": 3
    },
    "VoteCount": 1,
    "Id": 9243
  },
  "FileAttachments": [],
  "Comments": [
    {
      "Message": "We agree that the first part of this is a bug. We are filing a bug in our internal database to track this, and it will be fixed in a future release.\r\n\r\nIt is by design that the column widths do not shrink to avoid columns that oscillate while scrolling.\r\n\r\n",
      "PostedDate": "2009-02-18T10:18:06.037-08:00",
      "Id": -2147483648
    },
    {
      "Message": "",
      "PostedDate": "2009-02-18T10:23:18.377-08:00",
      "Id": -2147483648
    },
    {
      "Message": "",
      "PostedDate": "2009-02-19T10:48:06.947-08:00",
      "Id": -2147483648
    },
    {
      "Message": "",
      "PostedDate": "2013-02-21T18:41:32.897-08:00",
      "Id": -2147483648
    }
  ]
}