{
  "WorkItem": {
    "AffectedComponent": {
      "Name": "",
      "DisplayName": ""
    },
    "ClosedComment": "",
    "ClosedDate": null,
    "CommentCount": 0,
    "Custom": null,
    "Description": "I've been struggling with the performance on the grid for some time and have finally narrowed it down to checkbox columns that are autogenerated from a boolean column in the bound datatable. When using bools in the data table the application takes 35-40 seconds to start on my work station. If i switch the data type on column in the table to string, and still fill it with booleans as their string representations it is near instant to start. \n \nIn our production app, the window with the grid in it opens slower and slower every time you open the window.\n \nAdditionally - with checkboxes scrolling the grid is very jumpy, with strings, it's extremely smooth.\n \nWe are using .net 4.0 w/ VS2010.\n \nIn the attached sample, I'm creating a 70x70 grid of random state booleans with one column of strings. This replicates how the grid is used in our application. In MainWindowViewModel.cs there is a function \"GenerateData\" called in the ctor, change the parameter from true to false to see the performance issue. Generating data takes about 8-10ms on my work machine. The sample is a VS2010 project, and WPFToolkit is included as a project in the solution for performance profiling.\n \nSystem Specs:\nIntel Core 2 Quad Q9450 @ 2.66GHz\n4.00GB ram\n64 bit Windows 7\nTwo GeForce 8800 GT in SLI\nDirectX 11\nNo pen or touch input.",
    "LastUpdatedDate": "2013-02-21T18:40:46.84-08:00",
    "PlannedForRelease": "",
    "ReleaseVisibleToPublic": false,
    "Priority": {
      "Name": "Low",
      "Severity": 50,
      "Id": 1
    },
    "ProjectName": "wpf",
    "ReportedDate": "2010-01-21T00:11:27.083-08:00",
    "Status": {
      "Name": "Proposed",
      "Id": 1
    },
    "ReasonClosed": {
      "Name": "Unassigned"
    },
    "Summary": "Autogenerated Checkbox Column (displaying bools) has serious performance issue",
    "Type": {
      "Name": "Issue",
      "Id": 3
    },
    "VoteCount": 1,
    "Id": 11574
  },
  "FileAttachments": [
    {
      "FileId": 3727,
      "FileName": "WPFToolkit-checkboxperformance.zip",
      "DownloadUrl": ".\\3727"
    }
  ],
  "Comments": []
}