[
  {
    "Id": "442998",
    "ThreadId": "212681",
    "Html": "<p>Hello All, I'm new and trying to learn WPF. &nbsp;What I'm trying to do is fairly simple and probably being a newbie, this question may sound dumb. &nbsp;But I did search both here and google, still no answer. &nbsp;The following is my code (again, fairly simple and straight forward):</p>\r\n<p>&nbsp;</p>\r\n<p>Public DataAdapter as New sqlClient.sqlDataAdapter(sqlCommandstr,sqlConnectStr)</p>\r\n<p>Public dbTable as new DataTable</p>\r\n<p>First I define the sqlAdapter and a data table object, now,</p>\r\n<p>DataAdapter.SelectCommand.CommandText=&quot;select * from Company&quot; --&gt; where Company is just a table with few fields</p>\r\n<p>DataAdapter.fill(dbTable)</p>\r\n<p>Ok, so now the dbTable object is filled with the data extracted form SQL Server's &quot;Company&quot; table. &nbsp;Now I will fill the &quot;DataGrid1&quot; WPF datagrid control that I simply drag and drop into the WPF window.</p>\r\n<p>DataGrid1.ItemSource=dbTable.DefaultView</p>\r\n<p>Simple enough! &nbsp;And now hit the &quot;run&quot; button and the grid will show all the data from table &quot;Company&quot; on the screen.</p>\r\n<p>Now here the PROBLEM. &nbsp;When I try to populate the same table object &quot;dbTable&quot; with a different set of data from SQL Server by:</p>\r\n<p>dbTable.reset()</p>\r\n<p>DataAdapter.SelectCommand.CommandText=&quot;select * from Customer&quot; --&gt; where customer is another table in the database</p>\r\n<p>DataAdapter.fill(dbTable)</p>\r\n<p>Ok Now I've check the dbTable, I'm sure it is with new data in there and the old data of &quot;company&quot; table has been wiped clean.</p>\r\n<p>But when I do:</p>\r\n<p>DataGrid1.ItemsSource=dbTable.DefaultView</p>\r\n<p>The DataGrid1 now show only the header of the old table (the company table) and with ZERO rows. &nbsp;Why is that? &nbsp;Why the Grid did not show the new &quot;Customer&quot; table?</p>\r\n<p>I've tried many thing that were suggested throughout the search (on both google and here), but no use.</p>\r\n<p>I've tried to do Datagrid1.columns.clear(), Datagrid1.rows.clear() &nbsp;AND I've tried Datagrid1.itemssource=nothing &nbsp;or DataGrid1.items.Refresh(), NOTHING WORKS. &nbsp;The grid would either show the old header with no data or the grid will simply be wiped empty. &nbsp;So when the underlying data of the table object &quot;dbTable&quot; changes, how can I rebind the Grid to show the new dataset?</p>\r\n<p>P.S. I have the AutoGenerateColumns set the true.</p>\r\n<p>Thank you!</p>",
    "PostedDate": "2010-05-14T10:34:26.88-07:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "443871",
    "ThreadId": "212681",
    "Html": "<p>This would NOT be a DataGrid issue. &nbsp;The problem should be in the DataTable object. &nbsp;If you want to test, simply declare another DataTable Object and switch back and forth using the same Grid, I'm sure you going to see is not the grid problem. &nbsp;Now, as far as re-using the same DataTable, I would suggest that you simply create another DataTable and dispose the old one. &nbsp;I simply don't see any advantage of using the same DataTAble object unless you have some special reason which you can tell me and I can see how to attack the problem.</p>",
    "PostedDate": "2010-05-17T09:33:16.807-07:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  }
]