[
  {
    "Id": "474199",
    "ThreadId": "221833",
    "Html": "Any word when the next release for WPF Toolkit is coming?  It's been a couple of months and have not heard anything lately.  Roadmap would be nice.",
    "PostedDate": "2010-07-29T05:08:33.37-07:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "475056",
    "ThreadId": "221833",
    "Html": "+10 on this one. I'm totally stumped as to if this is supposed to work with .Net 4 or if we are supposed to be waiting for an update that will make it work with .Net 4. The tiniest of roadmaps would really be helpful.",
    "PostedDate": "2010-07-31T10:55:36.003-07:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "475082",
    "ThreadId": "221833",
    "Html": "<p>It's also unclear to me if it's supposed to work with .Net 4. Will there be an official VS 2010 release or something?</p>",
    "PostedDate": "2010-07-31T15:04:40.037-07:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "475102",
    "ThreadId": "221833",
    "Html": "<p>I tried a test app with the themes and seem to work.&nbsp;</p>\r\n<p>I'm mainly requesting&nbsp;any updates to use with new controls from last release ( accordion, rate, etc. ).&nbsp; When I use the toolkit with a 4.0 project, I get errors if I'm using VSM built in with 4.0&nbsp;and the VSM in toolkit.&nbsp; Also ( and a BIG also ), someone from toolkit team said they would be releasing a new Ribbon release within a couple of months.&nbsp; Any news on this one peeps?&nbsp; Are we going to have to wait til PDC10 to see anything?&nbsp; Please give us something.</p>",
    "PostedDate": "2010-07-31T17:26:14.65-07:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "475179",
    "ThreadId": "221833",
    "Html": "<p>I have emailed Scott Gu, Rob Relyea,&nbsp;over the past 4 months, and now Pete Brown.&nbsp;&nbsp; All ( cept Pete, he hasnt had time yet :) ) have said that something will be done, but all I see is silence.&nbsp;</p>\r\n<p>I can not recomend to anyone that they use anything off of this site, without the understanding that there is NO support.&nbsp; Some stuff works, other stuff doesnt.&nbsp;&nbsp; It truly is sad that the WPF toolkit is in this state compared to the Silvelight one.&nbsp;</p>\r\n<p>All I can suggest is that everyone who is interested in this site and the code here being up to par, email anyone at MS that they can, and raise a stink until it is either killed or supported.&nbsp; I have tried, both thru MS reps at the company I work at, and through the public emails.&nbsp; Heck, a note to Balmer might get some action.&nbsp; :)&nbsp; Who knows, it cant be worse ( at least I hope not ).</p>\r\n<p>pmont</p>",
    "PostedDate": "2010-08-01T08:57:17.687-07:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "475863",
    "ThreadId": "221833",
    "Html": "<p>shaggygi</p>\r\n<p>Just saw this.</p>\r\n<p><a href=\"http://10rem.net/blog/2010/08/02/announcing-microsoft-ribbon-for-wpf-rtw?utm_source=feedburner&utm_medium=feed&utm_campaign=Feed:+PeteBrown-WindowsClient+(Pete+Brown's+Blog+:+WindowsClient)\">http://10rem.net/blog/2010/08/02/announcing-microsoft-ribbon-for-wpf-rtw?utm_source=feedburner&amp;utm_medium=feed&amp;utm_campaign=Feed%3A+PeteBrown-WindowsClient+%28Pete+Brown%27s+Blog+%3A+WindowsClient%29</a></p>\r\n<p>Looks like Pete is trying.</p>\r\n<p>Paul</p>",
    "PostedDate": "2010-08-03T03:36:22.67-07:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "475930",
    "ThreadId": "221833",
    "Html": "<p>Thanks for the update.&nbsp; I've been waiting on this for months.</p>",
    "PostedDate": "2010-08-03T06:22:36.787-07:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  }
]