[
  {
    "Id": "478562",
    "ThreadId": "223048",
    "Html": "<p>Hi,</p>\r\n<p>&nbsp;&nbsp;&nbsp;&nbsp; I am using .NetFramework 3.5 and I want to use messagebox from Toolkit.exteded in my project but its for 4.0 framework. Can anyone please tell me are you people going to provide some binaries or installer for .Net 3.5 to use these extended controls.</p>\r\n<p>Thanks.</p>",
    "PostedDate": "2010-08-10T05:55:53.967-07:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "481437",
    "ThreadId": "223048",
    "Html": "<p>Are you talking about the Extended WPF Toolkit project located at <a href=\"http://wpftoolkit.codeplex.com/\">http://wpftoolkit.codeplex.com/</a>?</p>",
    "PostedDate": "2010-08-17T08:16:52.587-07:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "481438",
    "ThreadId": "223048",
    "Html": "<p>Hi Brian,</p>\r\n<p>&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp; Thanks for your reply. Yes I am looking for same. Actually I want to have customized message box in my application but I am working on .Net 3.5 framework. How can I use this messagebox in my application, as I have found the source code is developed in framework 4.0. please suggest some solution.</p>\r\n<p>Thanks.</p>",
    "PostedDate": "2010-08-17T08:20:57.81-07:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "481442",
    "ThreadId": "223048",
    "Html": "<p>There is a release scheduled for September.&nbsp; I will create binaries targeting the 3.5 framework.&nbsp; If you can't wait that long I suggest that you download Visual Studio 2010 and the Extended WPF Toolkit source,&nbsp;and change the target framework to .net framework 3.5 in the project' properties diloag.</p>",
    "PostedDate": "2010-08-17T08:26:51.977-07:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "481446",
    "ThreadId": "223048",
    "Html": "Brian thanks for quick reply, well i shall be very gratefull to you if you could provide me with the binaries as I have very tight sechedule of work to download VS2010. \r\nThanks.",
    "PostedDate": "2010-08-17T08:34:53.937-07:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "481454",
    "ThreadId": "223048",
    "Html": "<p>Now that I think about it, I am unable to provide 3.5 binaries, due to the fact that there are many dependencies on 4.0 features,&nbsp;such as the VisualStateManager, and named parameters.&nbsp; To target the 3.5 framework I would have to have a reference to the WPF Toolkit in order to use the VisualStateManager, which is something I am not willing to do.&nbsp; I do not want the Extended WPF Toolkit to have&nbsp;any dependencies on third party DLLs.&nbsp; If you need the toolkit kit for 3.5 you will have to download VS2010 and add a reference to the WPF Toolkit and modify all styles that use the VisualStateManager, to use the VisualStateManager from the toolkit instead.&nbsp; You will also have to modify a method in the ColorPicker control to not use named parameters.&nbsp; I would be willing to help you resolve any issues you run into.</p>",
    "PostedDate": "2010-08-17T08:46:44.673-07:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "481458",
    "ThreadId": "223048",
    "Html": "Yes! I was looking into the source code and found this Visualstatemanager introduced in .Net 4.0 framework and was thinking how ill it be resolved in 3.5 without putting extra efforts to resolve the dependencies. Any ways thanks for your help cheers.",
    "PostedDate": "2010-08-17T08:52:39.003-07:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "489352",
    "ThreadId": "223048",
    "Html": "<p>Due to popular demand, I have just released a version for Visual Studio 2008 and .NET 3.5. It does have a dependency on the WPFToolkit and won't work without it.</p>",
    "PostedDate": "2010-09-04T20:34:07.983-07:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  }
]