[
  {
    "Id": "505523",
    "ThreadId": "230456",
    "Html": "<p>Just how abandoned is this project?</p>\r\n<p>I mean, a lot of it obviously made it into .Net4, obviously that didn't include the charting controls etc.</p>\r\n<p>The last check-in here came with the release <strong>in February</strong>, and the [WPF Platform Roadmap] page is still talking about .Net<strong>3.5</strong> SP1 ... It's starting to look like <a href=\"http://wpf.codeplex.com/Thread/View.aspx?ThreadId=58833\">the Charting controls are abandoned</a>, and developers are <a href=\"http://blogs.msdn.com/b/delay/\">off working on the Windows Phone</a> instead ...</p>\r\n<p>Am I way off base, or is WPF Toolkit another IronRuby that's been stripped clean of development resources to accelerate development on other projects?</p>",
    "PostedDate": "2010-10-11T10:56:43.347-07:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "506515",
    "ThreadId": "230456",
    "Html": "<p>I share your feeling...</p>\r\n<p>The february 2010 release could surely need an update! I am thinking specifically about the AutoCompleteBox which has some issues. Some of them have been worked around in our own projects, but it would surely be pretty nice if there would come out an official release that takes care of this once and for all.</p>\r\n<p>Best regards,<br>Per</p>",
    "PostedDate": "2010-10-13T02:48:25.75-07:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "508965",
    "ThreadId": "230456",
    "Html": "<p>About 1 month ago, I red somewhere on a blog that MS is currently&nbsp;evaluating the resources to devote to this project.</p>\r\n<p>I think it's safe to say that this project is on hold right now.</p>\r\n<p>&nbsp;</p>",
    "PostedDate": "2010-10-18T13:10:10.17-07:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "508984",
    "ThreadId": "230456",
    "Html": "<p>Yes, the WPF team is evaluating this project along with all the other v.next features they are considering applying resources to (including the ones voted up by the community on uservoice).</p>\r\n<p>More details in the future. Thanks for your patience.</p>\r\n<p>Pete</p>",
    "PostedDate": "2010-10-18T14:00:28.827-07:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "509024",
    "ThreadId": "230456",
    "Html": "<p>Thanks for the feedback from inside MS. A little more transaparency would go a long way in the WPF community? Any chance you could shed a little more color on your reply.</p>\r\n<p>e.g. When will this decision be made on supporting this project? Are MS still devoting resources in general to WPF? Should the community just give up waiting and start releasing their own patches to the components?</p>\r\n<p>Ross</p>\r\n<p>&nbsp;</p>",
    "PostedDate": "2010-10-18T15:48:33.3-07:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "517243",
    "ThreadId": "230456",
    "Html": "\r\n<p>My Extended WPF Toolkit project is actively being developed. <a href=\"http://wpftoolkit.codeplex.com/\">\r\nhttp://wpftoolkit.codeplex.com/</a>.&nbsp; Maybe there are controls in there you can use.</p>\r\n",
    "PostedDate": "2010-11-04T11:58:50.993-07:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  }
]