[
  {
    "Id": "522241",
    "ThreadId": "234764",
    "Html": "\r\n<ol>\r\n<li>Is it possible to configure the WPF Ribbon in an Office 2010 VSTO application so that it picks up the style (blue, black, or silver) from Office 2010?\r\n</li><li>If that isn't possible, I can create styles for the WPF Ribbon that match the Office 2010 theme selected via HKCU\\Software\\Microsoft\\Office\\12.0\\Common\\Theme.\r\n</li><li>Does anyone have any WPF Resource dictionaries that match these themes? </li><li>If I try to create my own style to match the Black Office 2010 theme, I am running into a challenge:&nbsp; The foreground color for the Office 2010 Black theme is either black when a tab is selected or white when the tab is not selected.&nbsp; There doesn't\r\n seem to be a style property that reflects the foreground color of non-selected tabs.&nbsp; Does anyone have any suggestions that doesn't involve re-templating or subclassing?\r\n</li></ol>\r\n<p>Thanks,</p>\r\n<p>Michael</p>\r\n",
    "PostedDate": "2010-11-15T09:54:46.653-08:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "522319",
    "ThreadId": "234764",
    "Html": "\r\n<p>1.&nbsp;It is possible to configure / use WPF Ribbon in a Office 2010 VSTO application, However, it cannot pick up the Office 2010 Theme / style from Office.<br>\r\n2.&nbsp;Yes you can create a style(s) to match the selected Office 2010 Theme and you can also listen to the registry location specified in the post as well.<br>\r\n3.&nbsp;We don&rsquo;t have any WPF Resources that match those themes.<br>\r\n4.&nbsp;Making the kind of changes this posting is referring to falls into two categories, (1) changes to the WPF Ribbon Control or (2) changes to the WPF Ribbon Window. There are API &ldquo;shortcuts&rdquo; that will allow you to set brushes for the most commonly\r\n used parts / elements of the Ribbon Control. However, there is no easy way to make the changes to the Ribbon Window. Making changes to the Ribbon Window requires re-templating the Ribbon Window.</p>\r\n<p>Hope this helps!</p>\r\n<p>-Troy</p>\r\n",
    "PostedDate": "2010-11-15T12:47:41.953-08:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  }
]