[
  {
    "Id": "543182",
    "ThreadId": "240272",
    "Html": "\r\n<p>Hi all,</p>\r\n<p>There have been a number of questions posted here (and elsewhere) regarding how to get the toolkit and WPF 4.0 to play nicely together, but unfortunately very few answers. I am currently trying to get to the bottom of this as I require several controls from\r\n the toolkit but want to use the standard VisualStateManager. So, this is what I have done:</p>\r\n<ol>\r\n<li>Downloaded source for Toolkit (Mar 6 2010 release) </li><li>Loaded into VS2008 and built. </li><li>Build fails (great!) due to *.Design projects referencing incorrect (Blend 4) versions of Microsoft.Windows.Design.Extensibility &amp; Microsoft.Windows.Design.Interaction. Replaced these references with correct Framework 3.5 assemblies and the project\r\n built. NOTE: Controls.DataVisualization.Toolkit.Design requires Blend 3 assemblies not the normal framework 3.5 version!!!!\r\n</li><li>Project now builds successfully in VS2008 </li><li>Loaded the solution into VS2010 and upgraded. </li><li>Changed all projects to target &quot;.NET &nbsp;Framework 4 Client Profile&quot; </li><li>Excluded the Calendar, DataGrid, DatePicker, Themes and VSM folders from the WPFToolkit project (as I'm not using themes and the other classes are integrated into .NET 4.0).\r\n</li><li>Removed all &quot;vsm&quot; namespace declarations and references so the toolkit uses .NET 4.0's VisualStateManager\r\n</li><li>Correct a few other namespace changes (i.e. DatePicker, etc) </li><li>Built. </li></ol>\r\n<p>At this point I have a single error stopping me from building a Framework 4.0 compatible version of the toolkit:</p>\r\n<p style=\"padding-left:30px\">Error<span> </span>4<span> </span>Unknown build error, 'Method 'System.Windows.Controls.DataVisualization.Charting.DataPoint.OnApplyTemplate()' is security transparent, but is a member of a security critical type. Line 19 Position\r\n 48.' C:\\Source\\WPFToolkit\\DataVisualization\\Themes\\Generic.xaml<span> </span>19<span>\r\n</span>48<span> </span>Controls.DataVisualization.Toolkit</p>\r\n<p>And I haven't got a clue what it is. Anyone?</p>\r\n<p>Thanks,</p>\r\n<p>Ian</p>\r\n",
    "PostedDate": "2011-01-03T07:01:13.85-08:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "543321",
    "ThreadId": "240272",
    "Html": "Ian, can you try to target the full .Net Framework 4 when you build the projects? Some of the assemblies that are needed for security is excluded in the client profile. Hope that works!",
    "PostedDate": "2011-01-03T11:18:25.27-08:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "543631",
    "ThreadId": "240272",
    "Html": "\r\n<p>Hi,</p>\r\n<p>Thanks for the reply.</p>\r\n<p>Unfortunately I had already tried targetting the full framework to no avail. I just tried again now I've taken a more structured approach to sorting the issue out but same result: &quot;Error<span>\r\n</span>4<span> </span>Unknown build error, 'Method 'System.Windows.Controls.DataVisualization.Charting.DataPoint.OnApplyTemplate()' is security transparent, but is a member of a security critical type. Line 19 Position 48.'\r\n<span>&nbsp;</span>C:\\Source\\WPFToolkit\\DataVisualization\\Themes\\Generic.xaml<span>\r\n</span>19<span> </span>48<span> </span>Controls.DataVisualization.Toolkit&quot;</p>\r\n<p>Ian</p>\r\n<p>&nbsp;</p>\r\n",
    "PostedDate": "2011-01-04T03:43:24.633-08:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "544152",
    "ThreadId": "240272",
    "Html": "\r\n<p>I got the same problem, removed this control from samples project, and builded successfully...</p>\r\n<p>&nbsp;</p>\r\n<p>But, I have this error now, and don't know what its mean:</p>\r\n<p>&nbsp;</p>\r\n<p>&nbsp;</p>\r\n<pre>Error\t3\tInvalid XmlnsDeclaration occurs in assembly 'WPFToolkit, Version=3.5.40128.1, Culture=neutral, PublicKeyToken=null'. XmlnsDeclaration references a namespace 'System.Windows' that is not in the assembly.\tC:\\Projects\\_Projects\\MSD\\Controls\\WPFToolkitBinariesAndSource\\Source\\Samples\\MainWindow.xaml\t1\t1\tWPFToolkitSamples\r\n</pre>\r\n<p>&nbsp;</p>\r\n<p>Also maybe you can upload your code? I need only chart control from toolkit... But even new created window have this error. I did something wrong with a toolkit.</p>\r\n",
    "PostedDate": "2011-01-05T00:45:53.803-08:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "544370",
    "ThreadId": "240272",
    "Html": "\r\n<p>Hi Geneziz,</p>\r\n<p>I would be happy to upload the re-targetted toolkit once I have it compiling successfully, unfortunately it probably won't be any use to you in its current state as the build error I am receiving stems from the Controls.DataVisualization.Toolkit project;\r\n i.e. the chart control.</p>\r\n<p>I have removed the WPFToolkit and WPFToolkitSamples projects as these were no longer required but still have the &quot;security transparent&quot; issue outlined above.</p>\r\n<p>Ian</p>\r\n",
    "PostedDate": "2011-01-05T08:03:34.257-08:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "545900",
    "ThreadId": "240272",
    "Html": "\r\n<p>All,</p>\r\n<p>In case anyone is interested, a moment of inspiration led me to <a href=\"http://msdn.microsoft.com/en-us/library/dd233102.aspx\">\r\nthis page</a> on Security Transparent code. A quick read made it clear that, when targetting Framework 4, we adopted Level 2 Security Transparency, something the toolkit wasn't designed to work with. I therefore added the following assembly attribute to force\r\n compilation using Level 1 Security Transparency:</p>\r\n<p></p>\r\n<div style=\"color:black; background-color:white\">\r\n<pre>[<span style=\"color:blue\">assembly</span>: SecurityRules(SecurityRuleSet.Level1)]\r\n</pre>\r\n</div>\r\n<p></p>\r\n<p>And hey presto, everything compiled. I haven't performed a significant amount of testing on the Framework 4 compiled version of the toolkit so its entirely possible that it may yet contain issues derived from this change but if anyone would like a copy of\r\n the revised toolkit let me know and I'll look to upload it somewhere.</p>\r\n<p>Ian</p>\r\n",
    "PostedDate": "2011-01-08T04:29:51.393-08:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "555223",
    "ThreadId": "240272",
    "Html": "\r\n<p>Hi ibebbs,</p>\r\n<p>Have you encountered any issues with Microsoft.Windows.Design.Interaction and Microsoft.Windows.Design?</p>\r\n<p>I'm trying to do the same exercise as you but I seem to be caught up in namespaces that moved. I'm trying to find PropertyEditing which used to be in Microsoft.Windows.Design.</p>\r\n<p>Thanks,</p>\r\n<p>&nbsp;&nbsp; Rudi.</p>\r\n<p>&nbsp;</p>\r\n",
    "PostedDate": "2011-01-25T13:18:06.433-08:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "555440",
    "ThreadId": "240272",
    "Html": "\r\n<p>Hi Rudi,</p>\r\n<p>Are you sure you have replaced the references to the Design projects with the correct Blend versions? Read Step 3 above and ensure you're using the correct versions of the Blend assemblies.</p>\r\n<p>Once these are sorted out, the solution builds fine.</p>\r\n<p>Ian</p>\r\n",
    "PostedDate": "2011-01-26T01:13:25.233-08:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "556894",
    "ThreadId": "240272",
    "Html": "\r\n<p>Hi Ian,</p>\r\n<p>If you don't mind I would definately like a copy.</p>\r\n<p>I'm fighting with it and I'm sure I'll get it to work eventually and it would be a good exercise but having a retargeted project would also do the job ;-)</p>\r\n<p>Regards,</p>\r\n<p>&nbsp;&nbsp; Rudi.</p>\r\n",
    "PostedDate": "2011-01-28T07:41:14.137-08:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "565571",
    "ThreadId": "240272",
    "Html": "<p>Hi Ian,</p>\r\n<p>Last question hopefully. I have it compiling now (removed the .Design projects completely) but only the Toolkit.dll is being generated. The solution is set to compile all projects tho.</p>\r\n<p>Do you remember changing anything in order to compile all the dll's?</p>\r\n<p>thanks,</p>\r\n<p>&nbsp;&nbsp; Rudi.</p>",
    "PostedDate": "2011-02-13T14:13:54.077-08:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "570373",
    "ThreadId": "240272",
    "Html": "<p>FWIW, I went through the process of getting it all compiling in 4.0.&nbsp; It took some time, but I even have the WPFToolkit updated to compile.&nbsp;</p>\r\n<p>The process basically entailed removing using statements, and working through the source code to add explict namespaces infront of objects. We</p>\r\n<p>had made a fair amount of changes to support some internal things we were working on, which made it impossible to switch to the built in grid at this time. Perhaps when I have more time I will see about re-integrating the framework code.</p>\r\n<p>&nbsp;</p>\r\n<p>&nbsp;</p>\r\n<p>&nbsp;</p>",
    "PostedDate": "2011-02-22T12:15:22.757-08:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "651349",
    "ThreadId": "240272",
    "Html": "<p>Any progress? Does&nbsp;anyone&nbsp;have a working dll of the toolkit without the VisualStateManager? I hope there will be a release 'WPF 4.0 compatible' without the excess stuff that is already integrated in WPF 4.0.</p>",
    "PostedDate": "2011-08-02T13:03:21.223-07:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "651352",
    "ThreadId": "240272",
    "Html": "<p>I had the grid working in 4.0; but none of the automation stuff worked.&nbsp; I scrapped it, and derived from the WPF 4.0 DataGrid and using reflector was able to extract the functionallity I needed into derived classes with the automation working.</p>\r\n<p>BTW, if Microsoft would like a list of the internal and/or protected methods that are required to be able to derive and extend the functionallity of the built-in datagrid, please contact me and I will be more than happy to provide it.&nbsp; Also, I was rather disappointed that the source to theDataGrid was not included in the .NET 4.0 source packages</p>",
    "PostedDate": "2011-08-02T13:12:58.313-07:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  }
]