[
  {
    "Id": "590815",
    "ThreadId": "252290",
    "Html": "\r\n<p>Anyone have an idea when (or even if?) the WPF Toolkit will be updated?</p>\r\n<p>Today (2011-04-02) is the first time I've tried it.&nbsp; I'm surprised to find out that not only doesn't it build under VS2010 (which has been out for quite a while), but apparently the existing source package (uploaded 2010-03) didn't even build cleanly\r\n under VS2008.&nbsp; (According to this thread <a href=\"http://wpf.codeplex.com/discussions/240272\">\r\nhttp://wpf.codeplex.com/discussions/240272</a>).</p>\r\n<p>This makes me wonder about the level of commitment behind the WPF Toolkit.</p>\r\n<p>Should I just wait for Silverlight 5?&nbsp; (The main reason I don't just use Silverlight 4 OOB now is that I really want PInvoke, and SL5 is supposed to get that.)</p>\r\n<p>Thanks,<br>\r\nVic</p>\r\n",
    "PostedDate": "2011-04-02T20:31:15.24-07:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "591949",
    "ThreadId": "252290",
    "Html": "<p>i would also like to know this... the project seems pretty dead right now :(</p>",
    "PostedDate": "2011-04-05T05:40:15.59-07:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "593090",
    "ThreadId": "252290",
    "Html": "<p>See this thread&nbsp;<a href=\"http://wpf.codeplex.com/discussions/230456\">http://wpf.codeplex.com/discussions/230456</a>&nbsp;on the matter.</p>\r\n<p>A Pete who appears to work for MS ask for patience.</p>\r\n<p>Since that was last october, I won't hold my breath on it :)</p>\r\n<p>Even the Silverlight toolkit has not been updated for almost a year.</p>\r\n<p>I think more and more than the toolkits serve the purpose of driving adoption for a platform and then after that, well...</p>\r\n<p>&nbsp;</p>\r\n<p>&nbsp;</p>\r\n<p>&nbsp;</p>\r\n<p>&nbsp;</p>\r\n<p>&nbsp;</p>",
    "PostedDate": "2011-04-06T13:28:58.47-07:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "593121",
    "ThreadId": "252290",
    "Html": "<p>Hi fgoulet,</p>\n<p>Thanks for the pointer to the other thread, including Pete Brown's<br />over-5-month-old comment.&nbsp; Wow, that's _the_ Pete Brown.&nbsp; Hmmm.&nbsp; Silence <br />is itself a message I guess.&nbsp; Pete is currently working on his <br />Silverlight-5 book.</p>\n<p>Good point about it also being 1 year since the last update of the <br />Silverlight-Toolkit.&nbsp; But at least in that case they bothered to <br />update it for VS2010.</p>\n<p>Vic</p>",
    "PostedDate": "2011-04-06T14:27:37.317-07:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "593474",
    "ThreadId": "252290",
    "Html": "<p>Hi Vic,</p>\r\n<p>There is a beta of Silverlight 5 coming next week at Mix 2011.</p>\r\n<p>Providing they realease a new version of the Silverlight Toolkit as well, I suggest you try that before starting your project in WPF.</p>\r\n<p>Fred</p>\r\n<p>&nbsp;</p>",
    "PostedDate": "2011-04-07T06:04:26.913-07:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "593572",
    "ThreadId": "252290",
    "Html": "<p>Speaking as a WPF application developer...&nbsp; At this point, I suggest considering the WPF Toolkit as nothing more than a reference should you be interested in writing your own controls at some point, unless you're willing to fully understand the inner workings and maintain the controls yourself.&nbsp; Let's face it, developing controls takes significant time, money, and expertise.&nbsp; Clearly whoever is in charge at Microsoft feels those resources are better spent elsewhere.&nbsp; Maybe they'll change their mind someday and come back to it, but I wouldn't bet the well-being of my application on it.</p>",
    "PostedDate": "2011-04-07T08:21:23.137-07:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "594324",
    "ThreadId": "252290",
    "Html": "<p>@fgoulet:<br />Yes, I'll definitely download the Silverlight 5 beta next week.&nbsp; As you suggest, perhaps they'll rev the SL Toolkit (and maybe even the WPF Toolkit) at that time.&nbsp;<br />&nbsp;<br />@tgrand:<br />\"... nothing more than a reference ...\"</p>\n<p>Yes, I think you're right.&nbsp;</p>\n<p>I've used the Silverlight Toolkit sources a little and found them very helpful for understanding how the DataGrid works.&nbsp; Even if I never end up using a modified DataGrid, just being able to step through the source, put in&nbsp;tracing, break-points and comments&nbsp;can make it a lot easier to understand why it behaves the way it does in non-vanilla cases.</p>\n<p>Vic</p>",
    "PostedDate": "2011-04-08T10:57:19-07:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  }
]