[
  {
    "Id": "111871",
    "ThreadId": "33760",
    "Html": "Having used various other WPF grids, I was surprised to find no drag and drop header for group by functionality provided out of the box. I've played with the grouping capability and it works really well, but that still leaves us to build our own drag and drop header so that the user can easily drive this functionality. Is this planned as something that will be added in future CTP's, or do we all have to roll our own?\r\n",
    "PostedDate": "2008-08-18T13:54:08.867-07:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "112036",
    "ThreadId": "33760",
    "Html": "<span style=\"font-family:Calibri\">\r\n<p style=\"margin:0in 0in 10pt\"><span style=\"font-family:Calibri\">What you are essentially asking for is the ability to reorder groups?&nbsp; Reordering groups is an interesting feature but its effect on the structure of the underlying collection can be complicated. What is your expectation on this? Would you want to affect the ordering of the underlying data or are you thinking of this only at the view level? At this time we do not have plans for support this feature. However we will certainly keep this in mind for the future.</span></p>\r\n<p style=\"margin:0in 0in 10pt\"><span style=\"font-family:Calibri\">Thanks</span></p>\r\n<p style=\"margin:0in 0in 10pt\"><span style=\"font-family:Calibri\">Varsha (MSFT)</span></p>\r\n</span>\r\n",
    "PostedDate": "2008-08-19T06:31:25.763-07:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "112080",
    "ThreadId": "33760",
    "Html": "I think what he is referring to (and I would like to see this too) is something similar to the Xceed datagrid where there is a small panel above the datagrid where you can click and drag columns up from the grid into the panel and it would group by the columns that are in the upper panel.&nbsp; Maybe this could be a separate control that you could also use with other controls for grouping.\r\n",
    "PostedDate": "2008-08-19T08:24:59.94-07:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "112166",
    "ThreadId": "33760",
    "Html": "Thanks brenchld, that's precisely what I meant. The underlying functionality is great, but there's no 'out of the box' way for a user to drive it. With column sorting, you have provided the UI component, so there is some inconsistency here too, although it would be nice if the sorting was tri-state, where the third state is unsorted or original order.\r\n",
    "PostedDate": "2008-08-19T13:59:21.75-07:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "112210",
    "ThreadId": "33760",
    "Html": "<p style=\"margin:0in 0in 10pt\"><span style=\"font-family:Calibri\">Ah, sorry I misunderstood your scenario. The additional UI allowing users to drag drop column headers to do grouping is certainly a nice feature to have. However for the first version of the WPF DataGrid we do not propose to implement this out-of-the-box. As for tri-state sorting, we’ll consider that too for a future release. Thanks for letting us know your views on all these features.<br>\r\n<br>\r\nThanks<br>\r\nVarsha (MSFT)</span></p>\r\n",
    "PostedDate": "2008-08-19T18:18:16.673-07:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  }
]