[
  {
    "Id": "119053",
    "ThreadId": "35820",
    "Html": "In the DataGridCTPSample, the row header is bind with the 'Id'.<br>\r\nIf I want to fill the row header with a auto-increasing number just like that in excel, how can I get it? <br>\r\nthanks a lot!\r\n",
    "PostedDate": "2008-09-17T02:35:21.34-07:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "119085",
    "ThreadId": "35820",
    "Html": "Are you talking about the DataGridCTPSample from&nbsp;<a href=\"http://blogs.msdn.com/vinsibal/archive/2008/08/11/net-3-5-sp1-and-wpf-datagrid-ctp-is-out-now.aspx\">http://blogs.msdn.com/vinsibal/archive/2008/08/11/net-3-5-sp1-and-wpf-datagrid-ctp-is-out-now.aspx</a>?&nbsp; If so, that should be an example of how to do an auto-incrementing Id.\r\n",
    "PostedDate": "2008-09-17T05:21:55.357-07:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "119272",
    "ThreadId": "35820",
    "Html": "yes, I am talking about that&nbsp;DataGridCTPSample.<br>\r\nIn that example, the row header is bind with the 'Id', when the user resort the rows by other columns, the&nbsp;numbers&nbsp;in row&nbsp;header&nbsp;will be disordered.<br>\r\nI don't want that. I want the row header number always be in order just like that in excel.<br>\r\nCan I get it? Thx!\r\n",
    "PostedDate": "2008-09-17T19:37:00.34-07:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "119485",
    "ThreadId": "35820",
    "Html": "So it looks that you don't want the numbers in the row header to really be associated with each&nbsp;data item but more associated with the DataGrid itself.&nbsp; If you can wait till the full release there will be a LoadingRow event that you can attach to.&nbsp; In the event you can set the header each time to the number you want based on the item in the event args.&nbsp; If you can't wait, another option is to override the DataGrid.PrepareContainerForItemOverride and set the header in the same way described above after calling base.PrepareContainerForItemOverride.&nbsp; &nbsp;\r\n",
    "PostedDate": "2008-09-18T21:00:58.22-07:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  }
]