[
  {
    "Id": "126545",
    "ThreadId": "38158",
    "Html": "Hi,$0$0$0$0For my column headers I would like to have multiple rows, and in each cell in the column's, I would like them to be multiline.$0$0$0$0$0For example, I want 2 rows in the column header, then 2 lines in each cell, when the user clicks the top/bottom row it will sort the the column by the top/bottom cell contents, etc.$0$0$0$0$0Is this possible with this grid?$0$0$0$0$0Thanks$0",
    "PostedDate": "2008-10-21T08:00:51.7-07:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "127174",
    "ThreadId": "38158",
    "Html": "I'm not sure I follow your scenario.&nbsp; Could you describe it a little further.&nbsp; You want rows &quot;inside&quot; the header?\r\n",
    "PostedDate": "2008-10-23T06:17:55.47-07:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "127221",
    "ThreadId": "38158",
    "Html": "yes i would like rows inside the header... &nbsp;so below, the header has two rows, first name and second name, each cell would also have two lines(probably multiline, etc), I would also like to be able to sort by first name and last name, so when you clicked the last name in the column header, it would probably sort a hidden column that only had the last names listed, etc... hope this makes more sense<br>\r\nThanks!<br>\r\n----------------<br>\r\nFirst Name &nbsp; &nbsp; &nbsp; |<br>\r\nLast Name &nbsp; &nbsp; &nbsp; |<br>\r\n----------------<br>\r\nJohn<br>\r\nDoe<br>\r\n----------------<br>\r\nJane<br>\r\nDoe<br>\r\n----------------<br>\r\nBill<br>\r\nSmith<br>\r\n----------------\r\n",
    "PostedDate": "2008-10-23T08:14:35.377-07:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "127274",
    "ThreadId": "38158",
    "Html": "What about creating a template for the column header with two buttons, the top being the first name and the bottom being the last name.&nbsp; For the column, you can create a template column with a similar template except use TextBlocks instead.&nbsp; You can listen for the header button click events and then either sort it yourself or update the SortMemberPath property to either first or last name&nbsp;and get the DataGrid to sort the column.&nbsp; Let me know if that works out.\r\n",
    "PostedDate": "2008-10-23T11:01:27.317-07:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  }
]