[
  {
    "Id": "129364",
    "ThreadId": "38991",
    "Html": "Hi All,<br>\r\n<br>\r\nIf I add ApplicationSplitMenuItems to my ApplicationMenuItem, the Ribbon shows the first sub menu item and gives a small down arrow which when clicked shows the next item(s). <a href=\"http://s33.photobucket.com/albums/d74/chaks_2k/?action=view&current=application-menu-item.png\">Here is a screenshot</a>. How do I make all the sub menu items to be visible without the need of a down arrow If I open the applicationmenu item's sub menu (like in Office 2007) ?<br>\r\n<br>\r\nThanks<br>\r\nChaks<br>\r\n",
    "PostedDate": "2008-11-01T01:28:23.737-07:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "129802",
    "ThreadId": "38991",
    "Html": "anyone?\r\n",
    "PostedDate": "2008-11-03T15:17:48.373-08:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "129819",
    "ThreadId": "38991",
    "Html": "Hi Chaks,<br>\r\n<br>\r\nCan you send the code sample to repro. <br>\r\n<br>\r\nThanks, \r\n",
    "PostedDate": "2008-11-03T16:37:57.913-08:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "129821",
    "ThreadId": "38991",
    "Html": "<p>Hi, I think you're seeing this issue because you only have 2 top-level items.  The ApplicationMenu is set to be only as tall as it takes to display all of the top-level items, so when the sub menu opens, there's not enough space to display all of your children items.  <br>\r\n<br>\r\nA work-around you could try would be to set something with enough height in the RibbonApplicationMenu.RecentItemList.  This can even be a blank control, like the Rectangle in the following example:</p>\r\n<p>&lt;Ribbon.ApplicationMenu&gt; <br>\r\n    &lt;RibbonApplicationMenu Command=&quot;...&quot;&gt; <br>\r\n        &lt;RibbonApplicationMenu.RecentItemList&gt;<br>\r\n            &lt;Rectangle Height=&quot;300&quot;/&gt;<br>\r\n        &lt;/RibbonApplicationMenu.RecentItemList&gt;<br>\r\n        &lt;RibbonApplicationMenuItem Command=&quot;...&quot;/&gt;<br>\r\n        &lt;RibbonApplicationMenuItem Command=&quot;...&quot;&gt;<br>\r\n            &lt;RibbonApplicationMenuItem Command=&quot;...&quot;/&gt;<br>\r\n            &lt;RibbonApplicationMenuItem Command=&quot;...&quot;/&gt;<br>\r\n            &lt;RibbonApplicationMenuItem Command=&quot;...&quot;/&gt;<br>\r\n        &lt;/RibbonApplicationMenuItem Command=&quot;...&quot;/&gt;<br>\r\n    &lt;/RibbonApplicationMenu&gt; <br>\r\n&lt;/Ribbon.ApplicationMenu&gt; <br>\r\n<br>\r\nAlternatively, you may want to display some recent documents (or whatever makes sense for you scenario) in the RecentItemList.  The RibbonHighlightingList is an ItemsControl which has the same highlighting and selection behavior as in Office, and can be used in place of the Rectangle in the above example to display a list of recent documents.<br>\r\n<br>\r\nThanks!<br>\r\nSamantha</p>\r\n",
    "PostedDate": "2008-11-03T16:46:45.463-08:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "129878",
    "ThreadId": "38991",
    "Html": "Thanks Samantha! That worked! :)<br>\r\n<br>\r\nI would be happy if you could tell me what is RibbonApplicationSplitMenuItem used for.<br>\r\n<br>\r\nThanks<br>\r\n",
    "PostedDate": "2008-11-04T01:41:52.13-08:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "129973",
    "ThreadId": "38991",
    "Html": "Hi all,<br>\r\n<br>\r\nThis has gone some way to answering a question I had on adding a recent files list to the application menu. From the post above by Samantha I now know how to address the RibbonApplicationMenu.RecentItemList. Is there a quick way to get a list of recent files to bind to this or do we have to implement that functionality ourselves?<br>\r\n<br>\r\nThanks<br>\r\n",
    "PostedDate": "2008-11-04T09:41:15.903-08:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "129990",
    "ThreadId": "38991",
    "Html": "<p>chakkaradeep - RibbonApplicationSplitMenuItem can be used just like the regular RibbonApplicationMenuItem, except it adds a &quot;split&quot; functionality to the item which allows the user to either click on the button or mouse over to open the sub-menu.  If you look at Word 2007, you'll see that the Save and Print items are SplitMenuItems whereas Prepare, Send, and Publish are regular MenuItems.</p>\r\n<p>ChangedDaily - No, unfortunately you'll have to implement the recent files functionality yourself (unfortunately with no prior knowledge of the structure of your application, there's no way for us to know which files are considered recent or how to even find these files, so we felt that this was something that application authors would need to implement).  You'll just have to serialize the list of recent items somewhere, and then you can assign a collection of those items to the ItemsSource of the RibbonHighlightingList (if you'd like to use the highlighting list).</p>\r\n<p>Thanks!<br>\r\nSamantha</p>\r\n",
    "PostedDate": "2008-11-04T10:24:40.453-08:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  }
]