[
  {
    "Id": "130496",
    "ThreadId": "39338",
    "Html": "<div>Hi,</div><div><br></div><div>we have a DataGrid with a large number of dynamically added columns. <span style=\"font-style:italic\">EnableColumnVirtualization</span> and <span style=\"font-style:italic\">VirtualizingStackPanel.IsVirtualizing </span>is set to True, <span style=\"font-style:italic\">VirtualizingStackPanel.VirtualizationMode</span> is set to Recycling.</div><div><br></div><div>The DataGrid is surrounded by a ScrollViewer with <span style=\"font-style:italic\">CanContentScroll</span>=True. It looks like the ScrollViewer is forcing the width of the DataGrid to infinity, effectively disabling UI virtualization and crippling performance. Removing the ScrollViewer or setting an explicit width on the DataGrid fixes the issue, but leaves us with a not very functional UI.</div><div><br></div><div>How do we ensure that that ScrollViewer gives us a nice horizontal scrollbar, while keeping virtualization enabled?</div><div><br></div><div>(I have a hunch that overriding <span style=\"font-style:italic\">MeasureOverride</span>() can help me fix this problem, but as a newbie to WPF I'm unsure how to go about this. Creating a custom control must surely be overkill?). </div><div><br></div><div>Help, help!</div>",
    "PostedDate": "2008-11-06T06:11:55.527-08:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "130565",
    "ThreadId": "39338",
    "Html": "DataGrid like most of the other ItemsControls comes with its own ScrollViewer and UI Virtualization of rows/columns in tied with that instance of ScrollViewer. If you put DataGrid inside another ScrollViewer with out any restrictions on its size, then by definition of the ScrollViewer, DataGrid would get infinite Height and Width, thus making the inner ScrollViewer in-affective and hence resulting in no virtualization.<br>\r\n<br>\r\nTying UI virtualization to outer instance of ScrollViewer is not impossible, but is pretty advanced. Not only you should know how to Virtualize things, but also you should consider the impact of other controls (surrounding DataGrid) in the ScrollViewer on DataGrid, and it can become really complicated.<br>\r\n<br>\r\nI would recommend to change your layout such that you dont have to put DataGrid inside another ScrollViewer.<br>\r\n<br>\r\nI can take a shot if you could explain your scenario with more detail.\r\n",
    "PostedDate": "2008-11-06T09:57:11.31-08:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  }
]