[
  {
    "Id": "131271",
    "ThreadId": "39560",
    "Html": "Hi,<div><br></div><div> I can't find a were the littel (the one with number 15) is declared in DatePicker, I need to replace it or take the margin out, because the height of the control is to big.</div><div><br></div><div>Thanks,</div><div>Calin</div>",
    "PostedDate": "2008-11-10T00:14:28.267-08:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "131546",
    "ThreadId": "39560",
    "Html": "<p>You can find it in the DatePicker Style in Generic.xaml within the DatePicker's Themes folder. Inside the Style's ControlTemplate you will find a Grid with the x:Name PART_Root. Inside this Grid's Resources you will find another ControlTemplate for the button you speak of, with an x:Key DropDownButtonTemplate. Inside this template you will find another Grid after the VisualStateManager.VisualStateGroups. This Grid (along with its parent Grid) and its innards, are the contents of the template of the button you speak of. The number 15 is actually not really a number, its a Path. Perhaps that is why you had trouble finding it. You can either replace this template entirely, or you can alter it a bit.</p>\r\n<p>The fix this in the least amount of time and avoid creating any new graphics, I suggest the following: Change the values of the Width and Height Properties on the Grid after the VisualStateManager.VisualStateGroups from their hardcoded values to Height=&quot;{TemplateBinding Height}&quot; and  Width=&quot;{TemplateBinding Width}&quot;. This binds the values to those set on the actual Button that this template is applied to. To set these, go to the actual button that is being re-templated, it has an x:Name of  PART_Button, and change its Width and Height to whatever value suits your needs. Additionally, you may want to set the following Properties VerticalAlignment=&quot;Center&quot; and HorizontalAlignment=&quot;Center&quot;.<br>\r\n<br>\r\nIt won't look perfect (ie: the calendar hole or numbers may be proportioned imperfectly) but the values controlling their apperance can be tweaked on their respective element's within the ContolTemplate I mentioned above.<br>\r\n<br>\r\nI hope this helps :-)<br>\r\n<br>\r\n-Eric Fabricant, MSFT </p>\r\n<p> </p>\r\n<p> </p>\r\n<p> </p>\r\n<p> </p>\r\n<p> </p>\r\n<p> </p>\r\n<p><span style=\"font-size:13px;color:#ff0000\"> \r\n<p> </p>\r\n</span></p>\r\n<p>&nbsp;</p>\r\n<p> </p>\r\n<p> </p>\r\n<p> </p>\r\n<p> </p>\r\n<p> </p>\r\n",
    "PostedDate": "2008-11-10T18:58:48.26-08:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "131575",
    "ThreadId": "39560",
    "Html": " Thank you, this was of great help,<div><br></div><div>Calin,</div>",
    "PostedDate": "2008-11-10T21:42:12.373-08:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "131581",
    "ThreadId": "39560",
    "Html": "On the other hand,<div><br></div><div> It will great if I could find a way to style this thinks (like MaxHeight and MaxWidth for the textbox), it is somehow difficult to keep changes when a new toolkit is released.</div><div> Any ideea on styling a datetimepicker to support a certain height and width ?</div><div><br></div><div>Regards,</div><div>Calin</div>",
    "PostedDate": "2008-11-10T22:19:34.087-08:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  }
]