[
  {
    "Id": "131815",
    "ThreadId": "39716",
    "Html": "I'm trying to figure out how to change the appearance of the date picker, but I'm not sure where to go.  I'd just like to give the control a red background when an invalid date is entered - can someone please give me a push in the right direction.  I'm new to both WPF and the control toolkit. <br>\r\n<br>\r\nAt first I thought I would want to go down into<br>\r\n<br>\r\n<span style=\"font-size:13px;color:#0000ff\">\r\n<p>&lt;</p>\r\n</span>\r\n<p><span style=\"font-size:13px;color:#a31515\">Validation.ErrorTemplate</span><span style=\"font-size:13px;color:#0000ff\">&gt;<br>\r\n</span><span style=\"font-size:13px;color:#0000ff\">     &lt;</span><span style=\"font-size:13px;color:#a31515\">ControlTemplate</span><span style=\"font-size:13px;color:#0000ff\">&gt;\r\n<p>&nbsp;</p>\r\n</span></p>\r\nbut that would require me to re-draw the whole thing.  Is there any way to set a style trigger for this?<br>\r\n<br>\r\nThanks!\r\n",
    "PostedDate": "2008-11-11T14:10:17.737-08:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "237444",
    "ThreadId": "39716",
    "Html": "<p>Hi ,</p>\r\n<p>Can any1 Provide us solution for above problem</p>\r\n<p>&nbsp;</p>\r\n<p>With Regards,</p>\r\n<p>Mahender</p>",
    "PostedDate": "2009-09-22T11:49:05.117-07:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "237448",
    "ThreadId": "39716",
    "Html": "<p>Ha - good luck.&nbsp; I've&nbsp;learned the hard way to stay the hell away from anything on&nbsp;CodePlex.&nbsp; It's just a way to download half-complete controls in between .NET releases.&nbsp; Oh, and while I'm on my rant, let me say also - stay away from WPF anyway.&nbsp; It's just not worth it.&nbsp; Go build a nice RIA with jQuery.&nbsp; Might not have as many gradients in it, but it'll be solid, maintainable by normal developers,&nbsp;and&nbsp;a lot faster (and fun) to write.</p>\r\n<p>Ok, rant over.&nbsp; Sorry I don't have an answer to your question.</p>",
    "PostedDate": "2009-09-22T11:55:08.033-07:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "237504",
    "ThreadId": "39716",
    "Html": "<p>Hi arackaf, sorry to hear that you've had&nbsp;such an&nbsp;unfortunate experience with the DatePicker.&nbsp; When we shipped the controls on Codeplex, we shipped them &quot;as is&quot;.&nbsp; From time to time we triage concerns and questions on here and fix these bugs in our codebase.&nbsp; And about every 3 months we release a new version of the WPF Toolkit with additional fixes.</p>\r\n<p>For what it's worth, here's a potential solution to the issue you originally stated.&nbsp; What we recommend is getting a hold of the template part (using myDatePicker.Template.FindName API)&nbsp;for the text box (&quot;PART_TextBox&quot;).&nbsp; Then you can hook into the&nbsp;TextChanged event and parse the text in the textbox to a valid date format.&nbsp; And proceed accordingly.&nbsp; For example, pop up an error message or change the background color of the DatePicker.</p>\r\n<p>Hope that helps,</p>\r\n<p>Saied K.</p>",
    "PostedDate": "2009-09-22T13:32:25.523-07:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  }
]