[
  {
    "Id": "133018",
    "ThreadId": "40081",
    "Html": "Is it possible to add keytips for controls inside the ribbon menu? For example, when the &quot;CTRL&quot; key is pressed in Word 2007, the keyboard shortcuts are displayed below their respective controls. Is this feature available in the ribbon CTP?<br>\r\n<br>\r\nAlso the ribbon application menu by default adds a blank pane on the right that is used for split menus. If I have no split menus, can I disable this blank pane or it least enter information in it to avoid the empty space.<br>\r\n<br>\r\n<br>\r\nThank you.<br>\r\n<br>\r\n<br>\r\n",
    "PostedDate": "2008-11-17T01:20:02.597-08:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "133199",
    "ThreadId": "40081",
    "Html": "Hi Ziad,<br>\r\n<br>\r\nThe KeyTips feature is not implemented in the CTP but will be available in V1.<br>\r\n<br>\r\nAre you referring to the default gray area (where the Recent Documents list is in Word) or the white submenu?  You can put content in the gray area using the RecentItemList property - see an example of how to do that on this thread: <a href=\"http://www.codeplex.com/wpf/Thread/View.aspx?ThreadId=38991\">http://www.codeplex.com/wpf/Thread/View.aspx?ThreadId=38991</a>.  The white submenu should not appear if the menu item does not have children.<br>\r\n<br>\r\nThanks!<br>\r\nSamantha\r\n",
    "PostedDate": "2008-11-17T10:27:26.433-08:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "139065",
    "ThreadId": "40081",
    "Html": "Hi Samantha,<br>\r\n<br>\r\nI´m having a similar problem. I want to hide the default gray area, just want the left menu item area to be visible. Is there any way to do it?<br>\r\n<br>\r\nthanks<br>\r\n<br>\r\nEduardo &quot;Kyrw&quot;<br>\r\n",
    "PostedDate": "2008-12-09T10:56:29.177-08:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "139098",
    "ThreadId": "40081",
    "Html": "Hi Eduardo,<br>\r\n<br>\r\nYou should be able to do this by retemplating the Ribbon, however, I believe that doing that would be in violation of the Office Fluent UI Licensing Guidelines.  According to the &quot;Application Menu&quot; section in the &quot;Displaying the Application Menu&quot; subsection, item #5 (line 75) states that &quot;The Application Menu MUST have two vertical panes.&quot;  It then goes on to explain how the right pane (the gray area), SHOULD have a list of recent documents if applicable.  It doesn't explicitly say what should be in that gray area if you don't have a list of recent documents, but it seems implied that you're not supposed to take it out.  I would email the Office Licensing Team (<a href=\"mailto:officeui@microsoft.com\">officeui@microsoft.com</a>) if you have questions about what to do.<br>\r\n<br>\r\nThanks!<br>\r\nSamantha\r\n",
    "PostedDate": "2008-12-09T12:22:58.92-08:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "139125",
    "ThreadId": "40081",
    "Html": "Uhn, ok ^^. Realy thanks about the fast reply.! I think i will probably fill the area with something though.<br>\r\n<h3><a href=\"http://por.proz.com/kudoz/portuguese_to_english/linguistics/1931678-apesar_de.html\"><br>\r\n</a></h3>\r\n",
    "PostedDate": "2008-12-09T14:07:19.257-08:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  }
]