[
  {
    "Id": "136595",
    "ThreadId": "41195",
    "Html": "Hi group,<br>\r\nI'm starting with this wonderful new tool and I've a naive question: in a readonly datagrid, what is the suggested way of handling a mouse double click on a row (e.g. typically to edit the record into a separate window)? E.g. I could handle MouseDoubleClick bubbling from datagrid children, but this also includes the scrollbar buttons so that when the user rapidly clicks the scrollbar arrows a double click is detected but it's not wanted; in this case, I could examine the MouseDoubleClick event arguments for the original sender, so that I can exclude unwanted clicks, but I'm not sure about the source objects types to exclude or include (we might have complex templates in the row cells), so it does not seem an optimal solution. Or should I use some triggers in a row style? Or what else?<br>\r\n<br>\r\nThanks to all!<br>\r\n",
    "PostedDate": "2008-12-01T06:51:41.707-08:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "136599",
    "ThreadId": "41195",
    "Html": "Hi,<br>\r\n<br>\r\nI would handle the MouseDoubleClick event as you mentioned, then navigate the visual tree to determine whether the click occurred within a DataGridRow. See th following example for detecting whether a click occurred on a header or a cell:<br>\r\n<br>\r\nhttp://www.codeplex.com/wpf/Thread/View.aspx?ThreadId=40845<br>\r\n<br>\r\nRegards,<br>\r\nColin E.<br>\r\n--<br>\r\nhttp://wpfadventures.wordpress.com/ - my WPF blog<br>\r\nhttp://www.codeproject.com/KB/WPF/WPFDataGridExamples.aspx - WPF DataGrid Practical Examples <br>\r\n<br>\r\n<br>\r\n<br>\r\n<br>\r\n\r\n",
    "PostedDate": "2008-12-01T07:03:09.197-08:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "136854",
    "ThreadId": "41195",
    "Html": "Thank you very much Colin, this is what I needed!<br>\r\n",
    "PostedDate": "2008-12-02T02:22:33.82-08:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  }
]