[
  {
    "Id": "137222",
    "ThreadId": "41374",
    "Html": "<p>Hi,<br>\r\n<br>\r\nThanks for Calendar control.  Finally we have WPF control.  I found some questions when I started to use Calendar control:</p>\r\n<ol>\r\n    <li>How to show all 12 month in the calendar.  I found only how to show one month only.  In WinForms MonthCalendar control I could specify CalendarDimensions (i.e. 3, 4) and get all 12 months of the year.  I need the same functionality in this calendar.  How can I do it?</li>\r\n    <li>I have business requirements, users should be able to view calendar and navigate between months and years, but they should not be able to select any days.  How can I prevent them from selecting dates?  I used SelectionMode=&quot;None&quot; but it still allows me to select dates in the calendar.</li>\r\n    <li>I have list of BlackoutDates, how can I use binding to show them in the calendar?  I can do it via code, but could not find the way of doing it in XAML.</li>\r\n    <li>I need to show BlackoutDates in Red color, how can I do that?</li>\r\n    <li>How can I change size of the Calendar?  Whatever I do with Width or Hight It always stays the same size.</li>\r\n    <li>Where can I find more documentation or examples on Calendar control?</li>\r\n</ol>\r\n<p>Thanks a lot.<br>\r\n<br>\r\nSincerely,<br>\r\nVlad.</p>\r\n",
    "PostedDate": "2008-12-03T05:03:18.503-08:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "137420",
    "ThreadId": "41374",
    "Html": "To answer your questions:<br>\r\n<br>\r\n1) You can set the DisplayMode to Year<br>\r\n2) You can modify the calendar such that it never enters Month Mode but maintains a SelectedDate which includes that month. (Let me know if this option is of any interest to you and we can assist you with it).<br>\r\n3) You can modify CalendarBlackoutDatesCollection's Start and End Properties to be Dependency Properties (DP), though there may be other ways around this. Either way, DPs are required for DataBinding.<br>\r\n4) You will have to modify/override the Calendar's ControlTemplate for CalendarDayButton. Check out the source in Generic.xaml and look for a Path element with x:Name=&quot;Blackout&quot;<br>\r\n5)You can use a ScaleTransform<br>\r\n6) I would search the forums, we will be releasing additional documentation on MSDN in the future. If you have any particular questions though, we are happy to help :-)<br>\r\n<br>\r\n-Eric Fabricant, MSFT<br>\r\n",
    "PostedDate": "2008-12-03T13:35:41.703-08:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  }
]