[
  {
    "Id": "138373",
    "ThreadId": "41682",
    "Html": "I have a ContextMenu in DataGrid with some MenuItems attached to a command. When CanExecute for any of these commands is fired, the CurrentItem of the DataGrid is set to Null though it reality it is not because I fire the ContextMenu after selecting a valid cell in the grid. Here is the markup<div><br></div><div><div>&lt;MenuItem Command=&quot;local:Commands.ShowDealDetails&quot;</div><div><span style=\"white-space:pre\">\t\t</span>  CommandParameter=&quot;{Binding RelativeSource={RelativeSource AncestorType=ContextMenu}, <span style=\"white-space:pre\">\t\t\t\t\t\t\t\t</span>   Path=PlacementTarget.CurrentItem}&quot;/&gt;</div><div><br></div></div>",
    "PostedDate": "2008-12-07T04:00:36.283-08:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "139736",
    "ThreadId": "41682",
    "Html": "Can anybody please confirm this or not? Did anybody try a similar setup and it worked?\r\n",
    "PostedDate": "2008-12-11T09:00:26.193-08:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "140192",
    "ThreadId": "41682",
    "Html": "I'm having the same issue, however, it appears not null at times as well.&nbsp; I am also clicking a valid cell in the grid before I do the right-click to use the context menu, though it should not matter.&nbsp; I have yet to try and dig in and find out exactly why.&nbsp; As soon as I do I'll post again.<br>\r\n<br>\r\nCorey<br>\r\n",
    "PostedDate": "2008-12-12T15:10:34.823-08:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "140514",
    "ThreadId": "41682",
    "Html": "I found that I had to add an event handler for MouseRightButtonUp for a cell to be selected on right click (this happens before the context menu opens). Anything will do, even an empty one. Could this be the same issue?<br>\r\n",
    "PostedDate": "2008-12-15T02:17:12.577-08:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "141680",
    "ThreadId": "41682",
    "Html": "If there is any kind of keyboard focus change, the CurrentCell will be updated which will also update the CurrentItem and can possibly make it null.  If you are doing full row selection, binding to PlacementTarget.SelectedItem should work better.  The hack that mikj is doing is allowing the CurrentCell and CurrentItem to be set during that right-click which makes it work.\r\n",
    "PostedDate": "2008-12-18T13:02:29.907-08:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "143364",
    "ThreadId": "41682",
    "Html": "to me this looks something like an (inherent) issue (feature/error) with WPF on how it deals with message processing. And somewhere in that logic bound elements like CurrentItem reset whenever there is some change in focus. This and contextmenu not being in the tree, make it almost impossible to make a clean and simple design where it should be like. There is hardly anything more common in UI as context menu.<div><br></div><div>I have to say it is a very annoying feature.</div>",
    "PostedDate": "2008-12-29T11:13:22.67-08:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  }
]