[
  {
    "Id": "140535",
    "ThreadId": "42315",
    "Html": "Hello,<br>\r\n<br>\r\nI was wondering whether anyone has any hints/tips or is aware of sample code or coding guidelines for implementing custom ribbon controls such as gallery controls, color-selector or pattern-selector etc?<br>\r\n<br>\r\nI understand that I should implement the IRibbonControl interface, but that's about as much as I've gleaned so far.  I thought I'd ask before I start attempting to code something in a potentially incorrect manner.<br>\r\n<br>\r\nThanks,<br>\r\n<br>\r\nDaniel\r\n",
    "PostedDate": "2008-12-15T03:56:14.713-08:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "140638",
    "ThreadId": "42315",
    "Html": "Hi Daniel,<br>\r\n<br>\r\nYes, you'll need to implement the IRibbonControl interface.  Other things to keep in mind:<br>\r\n<br>\r\n- Resizing.  You'll need to handle switching the layout of the control based on the size that's being dictated by the RibbonWrapPanel.  For example, you can use Triggers to change the size/layout of the icon and label based on the values of IsLabelVisible and ImageSize.  You can take a look at the templates for other Ribbon controls (RibbonButton, for example) to see how we handle this.<br>\r\n- ToolTip.  You'll want to automatically generate a RibbonToolTip for the control using the values of the ToolTip properties on RibbonCommand (TooltipTitle, TooltipDescription, etc.).  We do this in the CoerceToolTip method on our Ribbon controls if you'd like to see an example.<br>\r\n<br>\r\nAlso, we will have a Gallery control in V1 of the Ribbon, in case you don't want to put in too much time making one :-)<br>\r\n<br>\r\nThanks!<br>\r\nSamantha\r\n",
    "PostedDate": "2008-12-15T09:14:20.117-08:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "140652",
    "ThreadId": "42315",
    "Html": "Thanks Samantha,<br>\r\n<br>\r\nAre you saying that the source-code is available for these Ribbon controls?  Or are you just referring me to the meta-data generated class description?<br>\r\nSorry, I'd probably understand if I were a seasoned WPF developer, but I'm normally writing C++.<br>\r\n<br>\r\nI'll look forward to v1 of the Ribbon.  Is there likely to be a preview/beta release of this in advance of the final release?<br>\r\n<br>\r\nThanks again for your help &amp; prompt reply,<br>\r\n<br>\r\nDaniel\r\n",
    "PostedDate": "2008-12-15T09:39:53.733-08:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "140672",
    "ThreadId": "42315",
    "Html": "Hi Daniel,<br>\r\n<br>\r\nWe're not currently shipping the source, but you can use .NET Reflector with the BamlViewer add-on to view the template and source that I mentioned above.<br>\r\n<br>\r\nWe're not sure yet if there's going to be another preview of the Ribbon before we release V1, but if there is, there will be a link posted on this site, so keep watching out for it here.<br>\r\n<br>\r\nThanks!<br>\r\nSamantha\r\n",
    "PostedDate": "2008-12-15T10:36:33.133-08:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  }
]