[
  {
    "Id": "143539",
    "ThreadId": "43195",
    "Html": "I have added a KeyGesture for a RibbonCommand and I have only one ExecutedRoutedEventHanlder for all ribbons.<br>\r\n<br>\r\nIn the callback function I use the OriginalSource property to know which button is pressed.<br>\r\nWhen the user press the key the OriginalSource isn't the RibbonButton but it is the Window, why ?<br>\r\nHow can I know what is the RibbonButton connected with ?<br>\r\n<br>\r\n            RibbonButton ribButton = (RibbonButton)e.OriginalSource;<br>\r\n            switch (ribButton.Name)<br>\r\n            {<br>\r\n            }<br>\r\n<br>\r\nThank you very much<br>\r\nMarco<br>\r\n",
    "PostedDate": "2008-12-30T09:03:41.257-08:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "154685",
    "ThreadId": "43195",
    "Html": "I have exactly the same problem.<div><br></div><div>I have a ribbon control and a data grid in my window. If I select a cell in the data grid and then press a ribbon button. The original source property is then set to the selected cell in the data grid. When I press the ribbon button before I select a cell, the original source property is set to the button.</div><div>From my understanding of RoutedEvents, this shouldn't be possible, because the ribbon control and data grid are not on the same path of the visual tree!</div><div><br></div><div>Has anybody a solution for this problem?</div><div>Any help will be appreciated.</div>",
    "PostedDate": "2009-02-05T07:49:51.83-08:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "157043",
    "ThreadId": "43195",
    "Html": "Does nobody know any solution or workaround?",
    "PostedDate": "2009-02-12T06:56:53.323-08:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "158839",
    "ThreadId": "43195",
    "Html": "I've found a workaround for that problem.<div>I hooked up both the PreviewExecuted and Executed event. They have both the same event handling method. In the PreviewExecuted event, the OriginalSource property has the correct value.</div><div>In the event handling handler I change the property Handled to true. So the Executed event won't fire, if the PreviewExecuted event was handled properly. I had to hook up both events, because when I just registered the PreviewExecuted event, all ribbon buttons were disabled. </div><div><br></div>",
    "PostedDate": "2009-02-17T23:47:18.15-08:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  }
]