[
  {
    "Id": "144839",
    "ThreadId": "43571",
    "Html": "Hello,<br>\r\n<br>\r\nI have a few questions about the Ribbon control.<br>\r\n<br>\r\n1) Does anyone know approximately when the next version of the Ribbon will be released?<br>\r\n2) Also where will this announcement take place at?&nbsp; (I am assuming there has only been 1 version released so far)<br>\r\n<br>\r\n<br>\r\nI would also like to encourage the developers who are making these controls to put them directly into Visual Studio / Blend in a SP or in the next versions.&nbsp; Its really a pain for a developer to have to hunt around a dozen sites to try to get all the upgrades he/she needs.<br>\r\n<br>\r\n<br>\r\n3) ohhh just being curious here....it sounds like this Ribbon control is being built from scratch.&nbsp; Any reason why they couldn't use the same code from the Office products?&nbsp; Almost seems like Microsoft wants to reinvent the wheel a few times.<br>\r\n<br>\r\n",
    "PostedDate": "2009-01-06T12:34:12.197-08:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "144884",
    "ThreadId": "43571",
    "Html": "<p>Hi ashlar64,</p>\r\n<p>Here are some answers to your questions:</p>\r\n<p>1) We are shooting for an out of band release in mid-2009.  That's as specific a date as we can give at this point.</p>\r\n<p>2) Yes, only the 1 CTP has been released so far.  We'll post an announcement to this Codeplex site (likely on the front page) and you'll probably also see updated content on WindowsClient.net when we release an update.</p>\r\n<p>3) Unfortunately the Ribbon used in MS Office was not written in WPF, so we weren't able to reuse any of that code.  As you can imagine, we certainly don't <em>want</em> to reinvent the wheel, but since we offer many different software platforms which are targeted towards different developer/end-user scenarios, in order to provide a Ribbon for each platform we have to write a control for each, and sometimes due to differences in the platforms, it's just not possible to reuse the code.  This is the first WPF Ribbon, so hopefully in the future any WPF-based Microsoft products which use a Ribbon will leverage the work we've done on this control. :-)<br>\r\n<br>\r\nHope that helps!<br>\r\n<br>\r\nThanks,<br>\r\nSamantha</p>\r\n",
    "PostedDate": "2009-01-06T15:05:22.733-08:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "178958",
    "ThreadId": "43571",
    "Html": "Thanks for the response.<br>\r\n<br>\r\nIts nearing mid-2009 and I am wondering if there is any new news on a specific date yet for the Ribbon?&nbsp; <br>\r\n<br>\r\n",
    "PostedDate": "2009-04-14T05:19:24.037-07:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "178979",
    "ThreadId": "43571",
    "Html": "I read the other day that VS 2010 Beta 1 was going to be released at TechEd 2009 ( May 11 ).  Would like to think something new will come from WPF Toolkit Team then.  I really need the fixes in next CTP to finish an app I'm working on.\r\n",
    "PostedDate": "2009-04-14T06:06:23.423-07:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "179202",
    "ThreadId": "43571",
    "Html": "Hi everyone,<br>\r\n<br>\r\nI have an update on the Ribbon schedule.  In light of our work for .NET 4.0, we will not be able to devote any resources to making progress on Ribbon until after .NET 4.0 Beta 2.  This means that we will likely not release V1 until later in the fall.  We are shooting to release a CTP with the RibbonCommand design change prior to V1, hopefully sometime during the summer.  Unfortunately we won't have any new Ribbon bits available in time for TechEd.<br>\r\n<br>\r\nThanks,<br>\r\nSamantha\r\n",
    "PostedDate": "2009-04-14T13:25:38.413-07:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  }
]