[
  {
    "Id": "148148",
    "ThreadId": "44512",
    "Html": "Hi all,<br>\r\n<br>\r\nI need a help regarding the .Net client profile configuration designer ,<br>\r\n<br>\r\nI installed the Beta version and configured the designer to install mu ClickOnce application and the .Net client profile as prerequest.<br>\r\n<br>\r\nI have two main problems :<br>\r\n<br>\r\n1. I need to start the ClickOnce application , what should I supply to the Location and Atguments field under the Launch application after installation section ?<br>\r\n2. I noticed , when I install the application , the ClickOnce application is installed and a shourtcut is created on the desktop, but the client cann't recive new updated . I put a new version on my server and the client didn't detect it. When I install the ClickOnce application without the designer setup , it recives updated normally. I check that the client throws &quot;User has refused to grant required permissions to the application.&quot;<br>\r\n<br>\r\nHow can resolve these problems.<br>\r\n<br>\r\nPlease your help.<br>\r\n<br>\r\nThanks in advance...\r\n",
    "PostedDate": "2009-01-18T15:40:46.12-08:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "192625",
    "ThreadId": "44512",
    "Html": "<p>Hi wasimf,</p>\r\n<p>Unfortunately there are some known limitations with the interaction between ClickOnce installation through the bootstrapper and the update functionality provided by the ClickOnce runtime. We have a new May 09 CTP online that has streamlined a few things, so please give it a try. To answer your questions:</p>\r\n<p>1. We have support to launch ClickOnce applications after installation, but it's not surfaced directly through the UI of the Configuration Designer just yet. Here's the secret sauce to apply: under the ClickOnce package entry in your Chained Installers list, go to the Install settings tab, Install settings pane and supply as the install argument the following: &quot;/shortcut:%temp%\\myapp.appref-ms&quot;&nbsp;(without the quotes). This causes the ClickOnceInstaller executable to emit a shortcut to the specified location. Then under &quot;Launch application after installation&quot; you can specify %temp%\\myapp.appref-ms as the command to run. I hope we can make this easier towards future releases.</p>\r\n<p>2. The underlying problem with deployment of ClickOnce applications through the API used by the ClickOnceInstaller tool is its shortcircuiting behavior for the regular ClickOnce UI experience for updating and such (what I often refer to as the &quot;blinking wire experience&quot;, the ClickOnce dialog you'll likely be familiar with). The idea of this approach to installation is to customize the user experience by providing custom UI during setup; unfortunately it also affects the runtime with regards to update checking. This said, there's an API you can use to check for ClickOnce updates programmatically, and display your own custom experience UI to ask the user to accept or reject the update. I'll have someone on the team dig up the sample code to accomplish this.</p>\r\n<p>Another option is to just specify the .application URI in the &quot;Launch application after installation&quot; settings. This will cause us to ShellExecute the .application URI, causing the application to get installed with the default ClickOnce user experience, preserving all regular updating behavior.</p>\r\n<p>Thanks,<br>-Bart</p>",
    "PostedDate": "2009-05-20T19:24:09.54-07:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  }
]