[
  {
    "Id": "154574",
    "ThreadId": "46290",
    "Html": "Hi,<br>\r\nThis is probably a very easy question for someone more experienced with this Datagrid, but I am just starting on it (although I used other ones in the past).<br>\r\n<br>\r\nIn the <span style=\"font-size:13px\">CellEditEnding</span> event handler I want to do some validation, and this validation (obviously) depends on which cell the user was just editing. How can I find out which column was edited? The e.column doesn't tell me the column name property just the DisplayIndex, which may change.<br>\r\n<br>\r\nThis is probably a very basic question and I am probably overlooking something obvious, but it's been killing me for a day now....<br>\r\n<br>\r\nThanks for any help!!!<br>\r\n<br>\r\nvitya\r\n",
    "PostedDate": "2009-02-05T01:33:18.583-08:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "154684",
    "ThreadId": "46290",
    "Html": "Hi,<br>\r\n<br>\r\nRather than validating in the CellEditEnding event, why not validate using the standard WPF binding validation mechanism? I provide a number of examples here:<br>\r\n<br>\r\nhttp://www.codeproject.com/KB/WPF/WPFDataGridExamples.aspx<br>\r\n<br>\r\nAnyhow, the Column property on the DataGridCellEditEndingEventArgs is a DataGridColumn, not the display index - so it should provide what you are looking for.<br>\r\n<br>\r\n<br>\r\n<br>\r\n<br>\r\nRegards,<br>\r\nColin E.<br>\r\n--<br>\r\nhttp://www.scottlogic.co.uk/blog/wpf/ - my WPF blog<br>\r\nhttp://www.codeproject.com/KB/WPF/WPFDataGridExamples.aspx - WPF DataGrid Practical Examples <br>\r\n<br>\r\n",
    "PostedDate": "2009-02-05T07:48:07.953-08:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "155277",
    "ThreadId": "46290",
    "Html": "Thanks Colin for the quick reply - unfortunately I had some other stuff of priority and couldn't continue working on this until now.<br>\r\n<br>\r\nYes, I have the DataGridColumn that was edited, but I don't know which property of the underlying data structure was edited. <br>\r\n<br>\r\nProbably I wasn't clear in my original question, so let me add some more background info to it:<br>\r\nMy datagrid is bound to a list of custom objects that I get from Linq. When I edit any of the fields, at validation I need to know which field the user changed.<br>\r\n<br>\r\nAbout your page on validation: Thanks for it, I am going to check it out right now and will let you know if I find what I am looking for.<br>\r\n<br>\r\nThanks again<br>\r\n<br>\r\nvitya\r\n",
    "PostedDate": "2009-02-07T01:24:11.417-08:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  }
]