[
  {
    "Id": "155198",
    "ThreadId": "46457",
    "Html": "I have a couple issues I haven't been able to figure out using a DataGrid.&nbsp; I have a DataGrid that is bound using ItemsSource which is set to an ObservableCollection.&nbsp; I then added a RowValidationRule.&nbsp; When a given row fails validation, it then prevents you from editing any row but that row.&nbsp; Is there a way to disable that behavior and allow me to edit other rows?<br>\r\n<br>\r\nI am removing rows by removing an entry from the ObservableCollection that the DataGrid is bound to.&nbsp; If that row has failed validation, and then I delete it, I cannot edit anything else in my DataGrid.&nbsp; Is this a bug, or am I missing a step here?<br>\r\n<br>\r\nPeter<br>\r\n",
    "PostedDate": "2009-02-06T13:37:24.283-08:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "156541",
    "ThreadId": "46457",
    "Html": "The reason the DataGrid does not allow editing of other rows is b/c of the side effects it has on editing transactions in general.  One of the main scenarios that we want to provide with validation is that when you do get into an error state, you have to ability to cancel out of it.  If you were allowed to edit additional rows, this ability will be forfeited.  Unfortunately, there isn't a way to customize this behavior currently and you will have to do your own cusotm validation to get this behavior.<br>\r\n<br>\r\n",
    "PostedDate": "2009-02-10T22:26:16.907-08:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "215994",
    "ThreadId": "46457",
    "Html": "<p>This seems to be the same issue as in: <a href=\"http://wpf.codeplex.com/Thread/View.aspx?ThreadId=51321\">http://wpf.codeplex.com/Thread/View.aspx?ThreadId=51321</a>.<br>Are there any plans to change this behavior?<br>Is there an example of how to do custom validation?</p>\r\n<p>&nbsp;</p>",
    "PostedDate": "2009-07-25T07:17:25.957-07:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "216676",
    "ThreadId": "46457",
    "Html": "<p>Hi,</p>\r\n<p>Problem is with one of LocalVaribale in Datagrid &nbsp;&quot;_HasCellValidation&quot;.If we can reset the &quot;HasCellValidationError&quot; to false.We can able to edit the datagrid on reseting data in datagrid or removing an item in Datagrid.</p>\r\n<p>I used reflection to reset the hascellvalidation.I know this is not right approach,but in order solve my problem,i used reflection approach.</p>\r\n<p>&nbsp;</p>\r\n<p>With Regards,</p>\r\n<p>Mahender</p>",
    "PostedDate": "2009-07-28T01:10:27.17-07:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "217652",
    "ThreadId": "46457",
    "Html": "<p>This &nbsp;situation arises for you as you are using IDataErrorInfo based validations and cannot cancel the edit.</p>\r\n<p>Micsoroft has said that with V2 (VS20100) &nbsp;this situation shoudl be alleviated as they are workign on changing the event firing sequences.</p>\r\n<p>&nbsp;</p>\r\n<p>Regards,</p>\r\n<p>Tracy</p>\r\n<p>&nbsp;</p>\r\n<p>&nbsp;</p>",
    "PostedDate": "2009-07-30T09:29:55.83-07:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  }
]