[
  {
    "Id": "156639",
    "ThreadId": "46829",
    "Html": "I have a scenario in which I am creating columns dynamically and then binding them to an object model, all code behind.<br>\r\n<br>\r\nWhat I'm trying to do now is to make some cells in the grid editable, but not the whole column. I have a property on the data objects called IsWritable that should be used to make the decision. What is the best way of doing this? I've tried using a DataTrigger on the style template and extending the DataGridTemplateColumn to allow for binding, but I can't seem to get it all to work.\r\n",
    "PostedDate": "2009-02-11T06:11:59.533-08:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "156644",
    "ThreadId": "46829",
    "Html": "Look at the BeginningEdit event, and search the archives here for more information.<br>\r\n",
    "PostedDate": "2009-02-11T06:23:27.75-08:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "156651",
    "ThreadId": "46829",
    "Html": "Thank you for you reply. I have tried searching the forums but didn't find anything useful.<br>\r\n<br>\r\nAre you suggesting that I should listen to the BeginningEdit event and then look at the data object and decide whether it should be editable at that point? Wouldn't that make it impossible to style the cells to somehow show which ones are editable? It seems a bit like a &quot;hack&quot;, I would prefer to do this with XAML if at all possible.\r\n",
    "PostedDate": "2009-02-11T06:41:36.253-08:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "157035",
    "ThreadId": "46829",
    "Html": "FYI I got this figured out now. <br>\r\n<br>\r\nI created a style with a DataTrigger set to change the ContentTemplate of the DataGridCell to either a TextBlock or a TextBox depending on my IsWritable property. This however did not allow for two-way binding, which forced me to build the style for each column code-behind using XamlReader.Load so I could specify the required binding path to each object.<br>\r\n<br>\r\nA bit dirty perhaps but I really couldn't figure out a better way of doing it. I ended up not having to use the DataGridTemplateColumn at all.\r\n",
    "PostedDate": "2009-02-12T06:38:56.707-08:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  }
]