[
  {
    "Id": "156962",
    "ThreadId": "46925",
    "Html": "Hi,<br>\r\nWe are trying to get a styled WPF Toolkit Datagrid (not the windows forms datagrid).<br>\r\n<br>\r\nI've\r\nsearched the web and everything I've found suggests you take control of\r\nthe cell style by utilising the loadingrow function and then getting\r\nthe datagridcell.<br>\r\n<br>\r\nOur grid is dynamically build from a datatable\r\nas we want to re-use the same style / colouring in several programs.\r\nThe problem is the code...<br>\r\n<br>\r\nDataGridCellsPresenter presenter = GetVisualChild&lt;DataGridCellsPresenter&gt;(row1);<br>\r\n<br>\r\nalways returns null as does either of the following...<br>\r\n<br>\r\nFrameworkElement fex = colz.GetCellContent(dgrid2.Items[z2]);<br>\r\nFrameworkElement fe3 = col3.GetCellContent(row1);<br>\r\n<br>\r\nwhere row1 is defined by;<br>\r\n<br>\r\nDataGridRow row1 = (DataGridRow)dgrid2.ItemContainerGenerator.ContainerFromIndex(z2);<br>\r\n<br>\r\nI\r\nfeel this should be straightforward, but so far most things suggest\r\nhard-coding the column names and driving the style from however many\r\nconverters are needed.<br>\r\n<br>\r\nI can supply an example program showing\r\nthe problem if needed, this is really stopping us from moving forward,\r\nwhich is frustrating as the answer seems just out of reach.<br>\r\n<br>\r\nIf anyone can help I'd be extremely grateful.<br>\r\n<br>\r\n-Colin H\r\n",
    "PostedDate": "2009-02-12T04:00:53.64-08:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "157337",
    "ThreadId": "46925",
    "Html": "Are you simply trying to style the cells? Have you seen the DatagridCellStyle property?<br>\r\n<br>\r\nI would recommend reading this blog post:<br>\r\n<br>\r\nhttp://blogs.msdn.com/jaimer/archive/2009/01/20/styling-microsoft-s-wpf-datagrid.aspx<br>\r\n<br>\r\nRegards,<br>\r\nColin E.<br>\r\n--<br>\r\nhttp://www.scottlogic.co.uk/blog/wpf/ - my WPF blog<br>\r\nhttp://www.codeproject.com/KB/WPF/WPFDataGridExamples.aspx - WPF DataGrid Practical Examples <br>\r\n<br>\r\n",
    "PostedDate": "2009-02-13T01:26:10.177-08:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "157355",
    "ThreadId": "46925",
    "Html": "Yes, I'm trying to colour the cells based on their data.<br>\r\nI can achieve a lot via converters but then I seem to be stuck with having a converter detect date fields to change the date display on auto-generated columns, indeed, I'm not even sure that is possible. That is to say, having a date converter automatically be called without implicitly defining the column name in the XAML, I've certianly not seen anything so far that has done that.<br>\r\n<br>\r\nThanks for the link,&nbsp; I hadn't come across that one before but alas it still doesn't give me what I need, I am beginning to suspect I'll have to build the grid completely using templated columns. It would of been nice to let the datagrid auto-generate and just react via converters, it just seems it *should* be possible, (does not mean it is of course).<br>\r\n",
    "PostedDate": "2009-02-13T02:27:20.84-08:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "157359",
    "ThreadId": "46925",
    "Html": "Perhaps you could provide a little example of what you have so far? That woudld woudl certainly help us to understand your problem better?<br>\r\n<br>\r\nRegards,<br>\r\nColin E.<br>\r\n",
    "PostedDate": "2009-02-13T02:37:46.077-08:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "157375",
    "ThreadId": "46925",
    "Html": "I'll extract the code into a simple version I can post a URL to, at present, it's chock full of various tests etc.. as I've tried to figure it out which would muddy the waters somewhat.<br>\r\n<br>\r\nPlease bear with me, but I'll hopefully get it up in the next couple of hours as I have to juggle it with my workload.<br>\r\n",
    "PostedDate": "2009-02-13T03:59:16.92-08:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "157450",
    "ThreadId": "46925",
    "Html": "Hello,<br>\r\nI've managed to put the program into a 'simple' form and put the solution/project up on Mediafire:<br>\r\n<br>\r\nhttp://www.mediafire.com/file/1xnwdn3ixrg/CellHighlight02X.zip<br>\r\n<br>\r\nThe comment at the top of the '.cs' file should help explain matters a bit and you can see how I've gone about constructing my grid / converters.<br>\r\nAs you may gather, the 'getmytable' function would normally represent a call to get a specific data table / query (in my case from an SQL server so it returns a datatable).<br>\r\n<br>\r\nregards<br>\r\nColin H. \r\n",
    "PostedDate": "2009-02-13T07:53:48.66-08:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  }
]