[
  {
    "Id": "161628",
    "ThreadId": "48413",
    "Html": "When the DataGrid is bound to an ObservableCollection that has no members, I got no &quot;extra row&quot; to add new instances.<br>\r\n<br>\r\nI''m not TOTALLY sure that my Eco data when there are no instances is giving something that DataGrid can understand, but I suspect it is.<br>\r\n<br>\r\nAnyone else have no &quot;initial extra row&quot; when there is no data in the table yet?<br>\r\n",
    "PostedDate": "2009-02-24T13:37:39.617-08:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "162231",
    "ThreadId": "48413",
    "Html": "Try this: http://www.codeplex.com/wpf/Thread/View.aspx?ThreadId=41207&amp;ANCHOR#Post151326<br>\r\n",
    "PostedDate": "2009-02-26T02:17:16.883-08:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "162315",
    "ThreadId": "48413",
    "Html": "I'm still working through that and trying to understand it.&nbsp; First attempt failed.<br>\r\n<br>\r\nWouldn't it just be easier if the datagrid had a property that was settable where I could tell it what class to use to create the new row instance?&nbsp; Instead of it having to figure it out on information that isn't there (the empty list)?<br>\r\n<br>\r\nHere is my actual code that creates the list that is bound to the itemssource:<br>\r\n<br>\r\nPersonList := new PersonListCollection&lt;Person&gt;( element.GetAsIList&lt;Person&gt; );<br>\r\n&nbsp;&nbsp;&nbsp;&nbsp;&nbsp; <br>\r\nAt this point, I am guessing the problem for the datagrid is that I am constructing the instance with a constructor that takes a parameter.&nbsp; And the parameter is an IList.&nbsp; And even though it was specified as an IList of Person, I suspect there isn't enough information there for the grid to figure out what to do.<br>\r\n<br>\r\nWhat do you think? <br>\r\n<br>\r\n\r\n",
    "PostedDate": "2009-02-26T06:38:44.12-08:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "162468",
    "ThreadId": "48413",
    "Html": "I think I give up tracing the code.<br>\r\n<br>\r\nAnd mikj, I think&nbsp; <a href=\"http://www.codeplex.com/wpf/WorkItem/View.aspx?WorkItemId=7960\">this link</a> is probably the more relevant post that I stumbled across.&nbsp; This one says, yep, we know, we'll make it a feature request.<br>\r\n",
    "PostedDate": "2009-02-26T12:27:31.893-08:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  }
]