[
  {
    "Id": "162682",
    "ThreadId": "48714",
    "Html": "Hello<br>\r\n<br>\r\nHere is my problem. I have a DataGrid with ItemSource. It works fine. This ItemSource is a list of elements. I added another column of type DataGridCheckBoxColumn and I'd like to bind it to an object, different from my ItemSource. How to do that ?\r\n<p>&nbsp;</p>\r\nI tried to browse rows but I don't know how to do that.<br>\r\nThanks for answers<br>\r\n<br>\r\nPierre\r\n",
    "PostedDate": "2009-02-27T03:15:17.737-08:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "162748",
    "ThreadId": "48714",
    "Html": "How your checkbox is related to other data in row?<br>\r\n",
    "PostedDate": "2009-02-27T06:41:53.467-08:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "162756",
    "ThreadId": "48714",
    "Html": "Well, I can maybe describe more my application.<br>\r\nI put Visual on a Canvas. Theses visuals have fields based on a class and this class contains a List, ProductsLinks.<br>\r\nIn my DataGrid, I have a lot of informations like PRODUCT_ID, PRODUCT_NAME... All theses informations are displayed for all my Visuals but the DataGridCheckBoxColumn should be binded to ProductsLinks (a list of PRODUCT_ID).<br>\r\nSo when I select a Visual, let's call it <strong>MyVisual</strong>, I check some products, store this in ProductLinks..., select another Visual, check other products... And finally, I'd like to retrieve the checked products when I select again <strong>MyVisual.<br>\r\n</strong>Hope it's clear<br>\r\n<br>\r\nThanks<br>\r\n",
    "PostedDate": "2009-02-27T06:52:04.927-08:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "163563",
    "ThreadId": "48714",
    "Html": "The way I see your problem is.....<br>\r\n<br>\r\n<ol>\r\n    <li>You have visuals on a canvas whose properties are bound to a class say &quot;MyDataObject&quot;.</li>\r\n    <li>You have a DataGrid, whose most of the columns are bound to the visuals.</li>\r\n    <li>You have one column, the data for which is not available on the Visual.</li>\r\n</ol>\r\n<p>Following are my suggestions...</p>\r\n<ol>\r\n    <li>Let every thing be bound to data. Meaning your visuals are bound to MyDataObject and let DataGrid also bound to a collection of MyDataObject. This way you dont have to worry about having gettting from two DataSources.</li>\r\n    <li>If this is not a possibility and if all of the visuals are FrameworkElements, then you can set the DataContext of your visual to MyDataObject and use paths like &quot;DataContext.ProductLinks&quot; in your Column's Binding property.</li>\r\n    <li>If this doesnt work either, then create an AttachedProperty some where, make sure that the value of this property on the visuals is MyDataObject and use this attached property in your Column's Binding property.</li>\r\n</ol>\r\n<p>I would strongly suggest option (1), if it works.</p>\r\n",
    "PostedDate": "2009-03-02T11:24:26.32-08:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  }
]