[
  {
    "Id": "167522",
    "ThreadId": "50053",
    "Html": "Hello Codeplex,<div><br></div><div>I have discovered a bug that occurs after I call ScrollIntoView and it throws a NullReferenceException. </div><div><br></div><div>Here is some background on my situation:</div><div><br></div><div>I have a generic user control containing a datagrid and functionality for editing, inserting and deleting items (rows in the datagrid).</div><div>I want to be able to use tab to get through controls so I have a style with Cell.IsTabStop = False.</div><div>But I want to be able to tab into the data grid. What I have done is added a handler for when the selected index property changes.</div><div>When the DataGrid.SelectedIndex property changes I focus on the cell in the first column and selected row.</div><div><br></div><div>This is done using the GetCell(row, column) method that has been floating around here (<a href=\"http://www.codeplex.com/wpf/Thread/View.aspx?ThreadId=34065\">http://www.codeplex.com/wpf/Thread/View.aspx?ThreadId=34065)</a>.</div><div><br></div><div>When calling ScrollIntoView when this change is made, I sometimes get a null reference exception, which I geuss could be expected if the list was changing. I have guard clauses for the row and columns to ensure that they lie in the index.</div><div><br></div><div>But after I catch this exception, the DataGridCellsPresenter class this an exception at line 98  Debug.Assert(dataGridOwner != null, &quot;We shouldn't be syncing properties if we don't have a valid DataGrid owner&quot;);</div><div><br></div><div>System.InvalidOperationException: Dispatcher processing has been suspended, but messages are still being processed.</div><div><br></div><div><br></div>",
    "PostedDate": "2009-03-12T14:16:04.467-07:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "185301",
    "ThreadId": "50053",
    "Html": "I am getting errors using scrollintoview that completely puts my application into a bad state.&nbsp; I would get the null reference exception stated above as well.&nbsp; I have not had time to dig deeply into this as I am deep into a production release today (and we have other issues to work through first).&nbsp; We had to remove the scrollintoview call...<br>\r\n<br>\r\nWhat release are you using?<br>\r\nJon<br>\r\n",
    "PostedDate": "2009-04-29T20:54:19.233-07:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "240845",
    "ThreadId": "50053",
    "Html": "<p>Sorry to bump an old post, but I'm experiencing this problem now..</p>\r\n<p>Did you find any solution to it?</p>",
    "PostedDate": "2009-10-01T04:04:09.79-07:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "241128",
    "ThreadId": "50053",
    "Html": "<p>Hi all,</p>\r\n<p>You can try to call UpdateLayout() before calling ScrollIntoView().</p>\r\n<p>Regards,</p>\r\n<p>Tony</p>",
    "PostedDate": "2009-10-01T19:35:28.613-07:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "241156",
    "ThreadId": "50053",
    "Html": "<p>Thanks!</p>\r\n<p>That solved my problem:)</p>\r\n<p>--Rune</p>",
    "PostedDate": "2009-10-01T22:38:25.31-07:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  }
]