[
  {
    "Id": "172063",
    "ThreadId": "51321",
    "Html": "I am using the DataGrid's RowValidationRules property to do row validation.&nbsp; I've embellished the RowStyle to draw a red border around the row and give a validate error message as a tooltip when validation fails.&nbsp; I've noticed that when validation fails, the editing of all other rows in the grid is blocked until the user fixes the problem in the error row.&nbsp; I consider this to be a good thing.&nbsp; However, if the user commits changes from the bound dataset to the database while a row is in the error state, then after the commit, the entire grid is locked.&nbsp; Nothing can be edited.&nbsp; <br>\r\n<br>\r\nI either need to know how to test whether the grid is currently in a state where a row has a validation error, or be able to clear the grid's edit lockout condition programmatically.<br>\r\n<br>\r\nDoes any one know how to do this?&nbsp; Thanks.<br>\r\n",
    "PostedDate": "2009-03-25T16:04:49.873-07:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "172930",
    "ThreadId": "51321",
    "Html": "Your validation rules should have logic to conditionally succeed. When you need to clear the errors you need to run the validations again this time such that they succeed.\r\n",
    "PostedDate": "2009-03-27T13:54:41.11-07:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "172939",
    "ThreadId": "51321",
    "Html": "How do I run validations again when I am locked out of performing any edit updates.?&nbsp;&nbsp; Thanks.<br>\r\n",
    "PostedDate": "2009-03-27T14:30:57.243-07:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "215993",
    "ThreadId": "51321",
    "Html": "<p>I'm having the same problem.</p>\r\n<p>@tmininger: Did you find a solution to this?</p>\r\n<p>@annegao: I don't understand your solution. Could you please&nbsp;elaborate?</p>",
    "PostedDate": "2009-07-25T07:09:08.71-07:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  }
]