[
  {
    "Id": "172707",
    "ThreadId": "51495",
    "Html": "Hi!<br>\r\n<br>\r\nIn my application I am trying to visualize if the transaction shown in my DataGrid are read or unread by making them bold if they are unread. When a user clicks on a row the transaction gets marked as read and should no longer be visible.<br>\r\nI did this with the CellTemplateSelector. But I have to write different templates for each Column in my DataGrid, because the properties shown in the columns are very differnet. It's like 30 or more templates and Template Selectors I need and I think this is very much for this little thing.<br>\r\n<br>\r\nI would like to know if there is a way, to set the whole row's fontweight to bold if the object in this row has the read-status set to false??<br>\r\n<br>\r\nIn the SelectionChanged-Event I am setting the read-property to true. But the Template is not changed. How do I tell the cells to reload the template when the read-property changes?<br>\r\n<br>\r\nThanks in advance! \r\n",
    "PostedDate": "2009-03-27T03:42:48.633-07:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "172924",
    "ThreadId": "51495",
    "Html": "Setting the FontWeight on DataGridRow should work for you. The best way to do it is to have a property in your ViewModel which represents the Marked-ness of the row and bind the FontWeight of row to that property in RowStyle.\r\n",
    "PostedDate": "2009-03-27T13:46:08.977-07:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "173351",
    "ThreadId": "51495",
    "Html": "Thank you! <br>\r\nThis works realy fine for me.<br>\r\n<br>\r\nBut I have another small problem in this case.<br>\r\nWhen the user clicks on a row the read-status must be saved immediataly into the database, because it is the only time it is sure, that the read-status is the only change on the object. So I say model.save in the selection-changed eventhandler. I can only save the whole ItemsSource of the datagrid, because the objects are childs and chields cannot be saved without their parent in our scenario. So the whole ItemsSource gets saved and the DataGrid is reloaded. A multiple selection is possible. When saving the read-status the selection gets lost. <br>\r\nIs there a way to somehow save the selected rows and when the grid reloads to select them again? Or any other suggestions handling the read-status save?<br>\r\n<br>\r\nThanks in advance!\r\n",
    "PostedDate": "2009-03-30T00:12:22.897-07:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "174212",
    "ThreadId": "51495",
    "Html": "I googled for hours. But I found no answer on the question how to save which Items in the grid are checked and redo this checking after the itemssource gets reloaded.<br>\r\nIt would be really great if anybody here could help me! Please!\r\n",
    "PostedDate": "2009-04-01T01:33:01.95-07:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  }
]