[
  {
    "Id": "174451",
    "ThreadId": "51998",
    "Html": "<p>On the RoadMap page for the WPF Toolkit, it states that Autocomplete is planned for a future release.  It doesn't say if this is going to be a new control, or just an easier way to provide the auto complete behavior for a DataGridComboBox column.  Is there any word on when this control/behavior will be included?</p>\r\n<p>In lieu of this, I really like the AutoComplete control that comes with the SilverLight toolkit.  Does anyone know if somebody has been able to port the control over to WPF?</p>\r\n<p>P.S.  - I do realize there is a discussion opened up <a href=\"http://www.codeplex.com/wpf/Thread/View.aspx?ThreadId=39115\">here</a> that explains how to add the auto complete behavior to a DataGridComboBox, but having a seperate control like the one included in the Silverlight toolkit would be alot nicer.</p>\r\n",
    "PostedDate": "2009-04-01T11:59:50.303-07:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "174485",
    "ThreadId": "51998",
    "Html": "The AutoComplete control will be a new control which is actually a port of the Silverlight AutoComplete.  I don't know of anyone (externally) who's done this yet, but we are working on it internally and should hopefully have it available within the next few months.  Thanks!\r\n",
    "PostedDate": "2009-04-01T13:09:13.187-07:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "174491",
    "ThreadId": "51998",
    "Html": "\r\n<div><span class=444072520-01042009>That's great to \r\nknow.  Can't wait.</span></div>",
    "PostedDate": "2009-04-01T13:26:08.363-07:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "282664",
    "ThreadId": "51998",
    "Html": "<p>Hi,</p>\r\n<p>just found this thread using google. Is this control already available, or am I missing something. I looked on the feature page of the WPF Toolkit, but I just found very little features. Is this because most features which are required in Silverlight (see the number of features in &quot;their&quot; toolkit :-) are already available in WPF, or because they are just not ported yet?</p>\r\n<p>Don't get me wrong, I know its open source, and I already found some other projects for my problem (autocomplete in WPF). I just like the Toolkit approach from Silverlight, because it garantuees a certain quality :-)</p>",
    "PostedDate": "2010-01-28T01:49:30.783-08:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  }
]