[
  {
    "Id": "174822",
    "ThreadId": "52083",
    "Html": "I've just started using the new DatePicker and Calendar controls from the latest release of the WPF Toolkit.  I was previously looking at the January release and found that the controls were so buggy that they were unusable.  This has been half fixed, but there is still a serious problem with them.<br>\r\n<br>\r\nIf I navigate to a particular month then select a day from within that month, then everything is fine, but if I select one of the visible dates from the end of the previous month or the start of the next month, the date selected is never correct.  For example, I am currently looking at February 1999, which displays the days from 25/01/1999 to 07/03/1999.  I click on 27/01/1999, but when the calendar closes, the DatePicker is displaying the date 30/12/1998 - it has jumped back an entire month from the date I selected.  I go back to February again and this time click on 04/03/1999, but the date selected once the calendar closes is 01/04/1999 - this time it has jumped a month ahead of the date I selected.  Was this ever tested??? <br>\r\n<br>\r\nI really do like this control and would use it a lot if it actually worked, but this bug has been there since the previous version and I'm getting the feeling that if I want to use the control I'm going to have to fix it myself, which I might not have time to do given our current project deadlines.<br>\r\n<br>\r\nHas anyone else noticed this bug and has it already been logged as something that needs to be fixed?<br>\r\n<br>\r\n",
    "PostedDate": "2009-04-02T07:35:55.113-07:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "174830",
    "ThreadId": "52083",
    "Html": "It turns out that this problem only occurs if you set the SelectedDate and the DisplayDate.  I thought that binding them both to the same property on my class would be fine, but it obviously isn't.<br>\r\n<br>\r\nWhat is the difference between DisplayDate and SelectedDate?  If I just bind the SelectedDate to my DateTime property on my object then it seems to work fine, but if I bind the DisplayDate as well I get the problem described above.<br>\r\n<br>\r\nSorry if I sounded like I was having a rant before, it's just been one of those days!\r\n",
    "PostedDate": "2009-04-02T07:57:41.61-07:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  }
]