[
  {
    "Id": "177873",
    "ThreadId": "52875",
    "Html": "Hi,<br>\r\n<br>\r\nI'm struggeling with what I can only assume is a bug in the WPF DataGrid.<br>\r\n<br>\r\nI have two datagrids inside a TabItem. One displays parent data (relations) and the second displays child date (contact persons) from the selected item of the first datagrid.<br>\r\nWhenever a new item is selected in the first DataGrid, the child data is loaded and bound to the ItemsSource of the second grid in code-behind. I use the CurrentCellChanged event for this.<br>\r\n<br>\r\nAll seems to work perfectly. Whenever I select a row in the first datagrid, the second datagrid correctly dispays the child data. But when I try to select a row in the second datagrid, suddenly all rows in that datagrid magically disappear. <br>\r\n<br>\r\nAfter some debugging, I found that after attempting to select a row in the second datagrid, the ItemsSource of that datagrid is actually empty, the DataView.Count property returns 0.<br>\r\n<br>\r\nThe strange thing is, if I put the focus on the second datagrid before assinging the new data to its ItemsSource, then it works correctly!<br>\r\nUnfortuately this is not an acceptable solution because users must be able to navigate the main datagrid using the keyboard. Putting the focus back on the main datagrid after binding doesn't work.<br>\r\n<br>\r\nHope someone can help me out.<br>\r\nThanks,<br>\r\n<br>\r\nPeter<br>\r\n<br>\r\n",
    "PostedDate": "2009-04-10T00:28:27.477-07:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "177928",
    "ThreadId": "52875",
    "Html": "Hi<br>\r\nIf you have a relationship set up between your 2 Tables, bind the ItemsSource of your Parent Grid to the Main Table Data and Bind your child DataGrid ItemsSource to the Relationship i.e. ItemsSource=&quot;FK_ContactPersons_Company&quot;. This should work. Good Luck!\r\n",
    "PostedDate": "2009-04-10T06:30:26.17-07:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "178160",
    "ThreadId": "52875",
    "Html": "Hi,<br>\r\nI'm not using a relationship. I do not fetch the child data from the database until asked for. However your solution sounds interesting and I'll give it a try. BTW, the same thing happens if I use a custom object collection as the child datasource instead of a datatable.<br>\r\nThanks.<br>\r\n<br>\r\nupdate: I found the issue also goes away if I do a &lt;datatable&gt;.AcceptChanges() after binding the child data source. I find this very strange because there is no bound relationship between the two datasources, and the main datasource cannot be modified. AcceptChanges() also steals away the focus from keyboard navigation though, so I now used a hack and placed this code in the MouseLeave event of the main datagrid. Not a very solid solution, but it works for me for now.<br>\r\n<br>\r\n",
    "PostedDate": "2009-04-11T07:05:03.94-07:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  }
]