[
  {
    "Id": "182057",
    "ThreadId": "54055",
    "Html": "I've been using the WPF V1 Ribbon control under XP.  The sample apps all seem to use a custom window instead of the normal XP window.  I don't care for that window drawing as it doesn't fit in with my normal XP theme and only want to use the RibbonTabs part.  Is there a way to turn off the Application button, Quickaccess toolbar, and application title?<br>\r\n<br>\r\nIf I could post an image here it would be a lot clearer what I want to remove.  If you look at this linked image, <a href=\"http://i.msdn.microsoft.com/Cc872782.Ribbon01(en-us,MSDN.10).png\">http://i.msdn.microsoft.com/Cc872782.Ribbon01(en-us,MSDN.10).png</a>, you'll see the parts above that I want to remove.  The app title row I want removed is the &quot;Document.docx - Microsoft Word&quot;.<br>\r\n<br>\r\nBasically all I want from that image is the buttons: Home, Insert, Page Layout, References, Mailings, Review, and View.<br>\r\n<br>\r\nThanks,<br>\r\nJeff\r\n",
    "PostedDate": "2009-04-21T15:48:21.26-07:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "182080",
    "ThreadId": "54055",
    "Html": "Hi Jeff,<br>\r\n<br>\r\nYou can use the Ribbon in a normal Window instead of a RibbonWindow, which will turn off the title-bar integration.  However, you are required by the Office Fluent UI License to use an Application Menu and Quick Access Toolbar if you use any other part of the Ribbon (including the tabs).  Technically, I think you could remove these parts by retemplating the Ribbon, but this would not be advisable since a) it would put you in violation of the license which you signed when you downloaded the control, and b) we didn't design the Ribbon to be used in this manner, so we can't guarantee that it would function properly.<br>\r\n<br>\r\nIf you just want a big Ribbon-ish toolbar, you might be able to make one using TabControl, but depending on how Ribbon-like you are, you may still be infringing on the Office Fluent UI License - I am in no way an intellectual property lawyer, so I can't really advise on this.  In general, my recommendation is to use the Ribbon and just make sure that you have all of the required parts included.<br>\r\n<br>\r\nThanks!<br>\r\nSamantha\r\n",
    "PostedDate": "2009-04-21T17:08:41.887-07:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "218411",
    "ThreadId": "54055",
    "Html": "<p>Try this:</p>\r\n<p>for instance, if you want to remove quick access toolbar from ribbon</p>\r\n<p>this.ribbon.QuickAccessToolBar = new RibbonQuickAccessToolBar() { Visibility = Visibility.Hidden };</p>\r\n<p>in the same way, if you want to remove application menu</p>\r\n<p>this.ribbon.ApplicationMenu = new RibbonApplicationMenu() { Visibility = Visibility.Hidden };</p>\r\n<p>They both works, good luck :)</p>",
    "PostedDate": "2009-08-01T22:29:00.297-07:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  }
]