[
  {
    "Id": "182316",
    "ThreadId": "54122",
    "Html": "One requirement for the application I am writing is to visually indicate the read/write vs read-only status of different cells in a DataGrid. Depending on circumstances, either the whole DataGrid instance or simply individual columns can have IsReadOnly=True.<br>\r\n<br>\r\nI was able to accomplish this by modifying the template for DataGridCell, changing the background color in a trigger setter, but I am getting a thin (1 pixel) white line around the (light gray) background color of each cell, immediately inside the horizontal and vertical grid lines. It's not a problem from a technical point of view, but it doesn't look very good, so how do I set it to the same color as the cell's background color?<br>\r\n",
    "PostedDate": "2009-04-22T06:23:57.397-07:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "183027",
    "ThreadId": "54122",
    "Html": "It's hard to immediately say who this background belongs to from the changes you made.  From a visual tree can you tell which element this is that is setting the background to white (from mole or snoop)?  Maybe a repro app would be more efficient.\r\n",
    "PostedDate": "2009-04-23T14:41:36.477-07:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "183137",
    "ThreadId": "54122",
    "Html": "I poked around with Mole, and took a closer look at the visual tree. It looks like the best option at least to begin with might be to restyle the DataGridCellsPanel, and when I manually set the Background on it, I get the result I am after for a whole row (which would translate to the DataGrid.IsReadOnly property), though I don't know how to apply this style based on the ancestor property. Suggestions?<br>\r\n<br>\r\nHowever, that still leaves the problem of re-styling a column properly based on the column's IsReadOnly property. Since I'm already styling the DataGridCell, and the closest parent element in the visual tree is the DataGridCellsPanel, I tried changing the background on that one. However, that affects the entire row (obviously), rather than just the specific column that I want to change the background of.<br>\r\n<br>\r\nThe logical tree is significantly less helpful in this case as it stops at the DataGrid control itself.<br>\r\n<br>\r\nAny insights would be greatly appreciated.<br>\r\n",
    "PostedDate": "2009-04-24T00:28:41.88-07:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  }
]