[
  {
    "Id": "185417",
    "ThreadId": "54931",
    "Html": "I am trying to implement a column in which the balance of a transaction is shown. I am using a TemplateCellColumn which contains a TextBox for editing the cell. <br>\r\nNow when the user enters a value like this 25,50 (In Germany we are using , as seperator for Euro and Cent) the , simply disapears and the value 2550 is set. When I type in 25.50 everything works like expexted. I have another Textbox in my UI when I set the value 25,50 in this Box everything goes the right way. Both Textboxes use the same Converters (ConvertBack simply returns the value entered), the only difference is that the first one is in the Grid and the other one not.<br>\r\n<br>\r\nCan anybody help me please?\r\n",
    "PostedDate": "2009-04-30T02:29:50.297-07:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "185462",
    "ThreadId": "54931",
    "Html": "There was a discussion here not too long ago about a very similar issue, and as I recall then it had something to do with the CurrentCulture or CurrentUICulture turning out to be wrong when the converter got called and that there was some XAML property that could be set to fix that. You may want to check that the culture passed to the converter is what you expect, and failing that, a forum search on those terms might be a good start.<br>\r\n<br>\r\nHope this helps.<br>\r\n",
    "PostedDate": "2009-04-30T04:45:31.777-07:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "185466",
    "ThreadId": "54931",
    "Html": "Hi!<br>\r\nDo you mean this Thread:<br>\r\n<a href=\"http://wpf.codeplex.com/Thread/View.aspx?ThreadId=51692\">http://wpf.codeplex.com/Thread/View.aspx?ThreadId=51692</a> ?<br>\r\n<br>\r\nJanR is writing that he can use a converter that completely ignores the UICulture and returns the correct value. In my converter I am not using the UICulture too.  <br>\r\nThe ConvertBack Method is very simple:<br>\r\nreturn value;<br>\r\nI debuged my application and it returns the correct value 25,50 but when my setter on the object is called (directly after the Converter) the comma is gobne and 2550 is set...\r\n",
    "PostedDate": "2009-04-30T04:55:04.067-07:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "185529",
    "ThreadId": "54931",
    "Html": "Yes, without having read it over in detail again, that looks like it's the one I was thinking about. The question would be what exactly is &quot;eating&quot; the comma, because I really doubt the TextBox or even the DataGrid would be doing it. (I've been working with WPF for some time now and never seen anything like that.) I would probably look very closely at what the converter gets (it should get exactly the value you entered) and what it returns. It might also be worthwhile to double-check all data types involved. Just the fact that the US number format works and the German one breaks still makes me inclined to think that this is a culture-dependent issue, however.<br>\r\n<br>\r\nNormally, it is the Convert method that gets called on an IValueConverter, not ConvertBack, so the fact that ConvertBack does exactly what it is supposed to do when it simply returns the value that was passed to it says very little. Actually, a lot of IValueConverter examples I've seen simply throw NotImplementedException in ConvertBack.<br>\r\n",
    "PostedDate": "2009-04-30T07:15:53.903-07:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "186508",
    "ThreadId": "54931",
    "Html": "It has been the ConvertBack method, because it get's called when the user sets a value that is bound to the UIelement with Mode=TwoWay.<br>\r\nThe Convert-method was working fine.<br>\r\nI did a lot of logging in this Converter and noticed that it is not enough to simply return the value is not enough. I found a very simple fix (At least for the moment, it needs further testing). Now I am replacing , with .<br>\r\n<br>\r\nSo it is no DataGrid-Bug ;-)<br>\r\nThank you for your help mikj.\r\n",
    "PostedDate": "2009-05-04T05:41:57.07-07:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  }
]