[
  {
    "Id": "194174",
    "ThreadId": "57453",
    "Html": "<p>Hi,</p>\r\n<p>I'm relatively new to WPF and I'm using the Datagrid from the latest version of the toolkit.</p>\r\n<p>The datagrid is bound to a list and I want to be able to recalculate a cell in the grid when the value in one of the other cells is changed.&nbsp; I thought I could do this by using the CellEditEnding event but this doesn't seem to get fired.&nbsp; I've checked the BeginningEdit event and this doesn't seem to be fired either.&nbsp;&nbsp; Other events such as GotFocus and LostFocus are being fired.</p>\r\n<p>What am I doing wrong?</p>\r\n<p>Thanks</p>",
    "PostedDate": "2009-05-26T02:47:03.1-07:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "194506",
    "ThreadId": "57453",
    "Html": "<p>BeginningEdit should fire when the cell is not readonly and&nbsp;the currentcell is not null.&nbsp; Does the action you are doing meet this requirement?</p>",
    "PostedDate": "2009-05-26T13:48:24.927-07:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "194650",
    "ThreadId": "57453",
    "Html": "<p>The cell is not readonly and the current cell is not null.&nbsp; In fact I have managed to achieve what I wanted using GotFocus (to save CurrentItem)&nbsp;and LostFocus (to carry out the calculation I wanted to) and it works perfectly.&nbsp; However, I always like to find out why something doesn't work.&nbsp;</p>\r\n<p>In fact when I was investigating further both BeginningEdit and CellEditEnding would fire occasionally but it seemed to be random and very sporadic.&nbsp; It also seemed not to be linked to my current actions.&nbsp; For example it would fire a BeginningEdit event and then immediately fire a CellEditEnding event without any further key strokes.</p>",
    "PostedDate": "2009-05-27T00:05:47.18-07:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "194756",
    "ThreadId": "57453",
    "Html": "<p>What are the actions you are doing to initiate editing?</p>",
    "PostedDate": "2009-05-27T05:29:25.51-07:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  }
]