[
  {
    "Id": "195176",
    "ThreadId": "57729",
    "Html": "<p>I am very new to WPF and have an issue trying to properly set themes.</p>\r\n<p>I have managed to correctly set a theme in the &lt;Application.Resources&gt; section of Application.xaml. I can flip back and forth between the different themes and controls such as TextBox, Expander, ListView, etc. pick up the theme. However, the Window does not seem to be picking up the colour or gradient as indicated in the samples. When I use ShinyBlue, for instance, Labels are invisible because the ForeColor of the Label is white and Window Background is also white. The Background is suppposed to be a grayish gradient.</p>\r\n<p>Any ideas?</p>",
    "PostedDate": "2009-05-28T06:18:08.31-07:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "246000",
    "ThreadId": "57729",
    "Html": "<p>Same problem here Eddie, this is my first crack at a WPF app though so I'm probably making an obvious mistake but I'll be damned if I can see what it is :(&nbsp; Did you figure it out?</p>",
    "PostedDate": "2009-10-15T05:52:57.28-07:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "246633",
    "ThreadId": "57729",
    "Html": "<p>No. I never got any interest in the post. My app is just a little utility app (and a learning exercise) so I kept the theme in but just ignore it. I actually think it is a problem with styling the Label control now rather than a problem styling the Background property of Window.</p>\r\n<p>Here is ExpressionLight which works:</p>\r\n<p><a href=\"http://imgur.com/zLenR.png\">http://imgur.com/zLenR.png</a></p>\r\n<p>Here is ShinyBlue which does not:</p>\r\n<p><a href=\"http://imgur.com/gLY1K.png\">http://imgur.com/gLY1K.png</a></p>\r\n<p>I also found a bunch of other issues with the Themes and Theming Library on CodePlex. I have been lazy and have not submitted them as defects to the projects. Here is my documented list:</p>\r\n<div>\r\n<ul>\r\n<li>Several broken themes {UX*, ShinyDarkGreen, DavesGlossyControls}</li>\r\n<li>Difficult to grab Column splitter for resize in the ListView for Expression* themes</li>\r\n<li>Labels are impossible to see on ShinyBlue and ShinyRed (i.e White on White)</li>\r\n<li>Testing the ViewModel is difficult with Static methods (IThemeManagerFacade)</li>\r\n<li>ComboBox has extra row in many themes {Expression*, ShinyRed, ShinyBlue, WhistlerBlue}.</li>\r\n</ul>\r\n<p>Regards.</p>\r\n</div>",
    "PostedDate": "2009-10-16T10:19:15.223-07:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "250360",
    "ThreadId": "57729",
    "Html": "<p>Ditto here. Theme looks horrid because Window seems to ignore it.</p>\r\n<p>I wonder... is this meant to be used only in SilverLight? If that's the case, perhaps SL doesn't actually have a Window theme and therefore it's not being picked up in the app. Maybe we just need to make a style that inherits the same Blue/Grayish background gradient and apply it to window.</p>",
    "PostedDate": "2009-10-27T14:41:43.423-07:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  }
]