[
  {
    "Id": "197275",
    "ThreadId": "58332",
    "Html": "<p>Hi,</p>\r\n<p>Some quick&nbsp;help would be appreciated.</p>\r\n<p>I have a DataGrid populated with an entity model:</p>\r\n<p style=\"padding-left:30px\">this.DataGrid.ItemsSource = this.EntityObject.GetAllEntities()</p>\r\n<p>It works fine for me with a simple Entity. I add a child Entity to the form and create a new grid. The new grid&nbsp;should be bound to the&nbsp;child Entity List property:</p>\r\n<p style=\"padding-left:30px\">this.ChildDataGrid.ItemsSource = this.ChildEntityObject.EntityList</p>\r\n<p>Then I Populate the Child Objects&nbsp;EntityList Property with Data Entities</p>\r\n<p style=\"padding-left:30px\">this.ChildEntityObject.GetEntitiesByParentPK()</p>\r\n<p>It is automatically populated by my middleware framework in a ParentRetrieved() method.</p>\r\n<p>I have another method in the framework ParentNavigated()&nbsp;in order to requery child data whenever we navigate to another entity in the parent entity list.</p>\r\n<p>I have rigth now&nbsp;two problems:</p>\r\n<p>First, I need to Bind The Grid ItemsSource to the Child Objects EntityList property. Data Entities are stored in an objects EntityList property and this list changes for each parent entity or row.</p>\r\n<p>Second, What is the event that is fired in the Datagrid when I&nbsp;navigate to&nbsp;a diferent&nbsp;row&nbsp;(Click or Key)?</p>\r\n<p>I&nbsp;was thinking&nbsp;that when I selected a diferent row the DataGrid changed the selection of&nbsp;its underlying dataset . When I selelct a different row in the parent DataGrid the child data should be requeried but it doesn&acute;t happen.</p>\r\n<p>So, How can I manage this in order to change the selection programatically? It would fire my navigated event and requey the child data.</p>\r\n<p>Thanks in advance.</p>",
    "PostedDate": "2009-06-03T07:44:30.167-07:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "198146",
    "ThreadId": "58332",
    "Html": "<p>I haven't worked with EntityObjects but with DataSets I know you have to specify IsSynchronizedWithCurrentItem=&quot;True&quot; on your grid to change the current item of the collection when the selected item of the grid changes.</p>\r\n<p>Also, there is an event called SelectionChanged on the DataGrid, doesn't it work?</p>",
    "PostedDate": "2009-06-05T03:19:55.43-07:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  }
]