[
  {
    "Id": "198702",
    "ThreadId": "58685",
    "Html": "<p>Hi Guys,</p>\r\n<p>I'm just getting started with .net in general really...</p>\r\n<p>I am making what i think is a fairly simple app. I have a database with a couple of tables and some datagrids which i want to display a combination of data from the data tables.</p>\r\n<p>I have the linq queries displaying in the datagrids but i'm a bit stumped as to how to write back to the database, and when i do (by searching the database for the item id and updateing the data in the table) the wpf datagrid bound to the data does not update even though i thought linq implemented iNotifyPropertyChanged.</p>\r\n<p>&nbsp;</p>\r\n<p>Whats the best/simplest way to bind a linq query (and not just a straight table dump i.e. two tables with reference between then) to a datagrid control? And how do i write data back to the database if a user clicks a button or adds a new line to the datagrid?</p>\r\n<p>&nbsp;</p>\r\n<p>Currently i have a Class VisitorsTable which just gets the linq datacontext and has a function which returns a Table&lt;CurrentVisitor&gt; call getVisitors;</p>\r\n<p>Then in my App.xml i declare an ObjectDataProvider which uses MethodName getVisitors.</p>\r\n<p>and in my datagrid i use ItemSource=&quot;{Binding Source={StaticResource VisitorsDataProvider}}&quot;</p>\r\n<p>&nbsp;</p>\r\n<p>Any help would be greatly appreciated.</p>\r\n<p>C# 3.5 + Linq + WPF is great but it can be a little tricky getting my head around how it all works. :)</p>",
    "PostedDate": "2009-06-07T03:08:32.71-07:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "200802",
    "ThreadId": "58685",
    "Html": "<p>To write back to the database, use dataContext.SubmitChanges().&nbsp; Some places that are common to do this is when a row is committed or a new item is added.&nbsp; You can listen to the RowEditEndingEvent and submit changes there.</p>",
    "PostedDate": "2009-06-12T05:51:51.26-07:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "201103",
    "ThreadId": "58685",
    "Html": "<p>Thanks vinsibal.</p>\r\n<p>I made a RowEditEndingEvent and put a dc.SubmitChanges() call in. If i edit a row nothing happens (but the event is called), which is wierd.</p>\r\n<p>If i put in a new row an unhandeled exception is thrown but this because i proberbly don't have a handler.</p>\r\n<p>&nbsp;</p>\r\n<p>One clue as to why it isn't happening might be this.</p>\r\n<p>I'm using AutoGenerColumns but in my debug output i'm getting</p>\r\n<p>&quot;System.Windows.Data Error: 39: BindingExpression path error: '*COLUMNNAME*' property not found on 'object' .....target element is 'TextBlock' (Name=''); target property is 'Text' (type 'String)</p>\r\n<p>&nbsp;</p>\r\n<p>Any idea's how to fix that?</p>\r\n<p>all i'm doing to generate the data is creating a datacontext to the linq data in my class initalizing it and then assigning the datacontext of the grid to it.</p>\r\n<p>The current data is displayed in the grid, but if i edit nothing :(</p>\r\n<p>&nbsp;</p>\r\n<p>Thanks!</p>",
    "PostedDate": "2009-06-13T03:42:23.97-07:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  }
]