[
  {
    "Id": "199957",
    "ThreadId": "59054",
    "Html": "<p>Hi,</p>\r\n<p>I have been using and customising the expression dark theme, howver i think this issue applies to most of the themes within the WPF themes release.&nbsp; I have the issue when i change from one theme to another. The selected tab is lost when changing theme.</p>\r\n<p>I change theme by emptying application level merged dictionaries&nbsp; and them adding the new theme resource dictionary to that collection.</p>\r\n<p>Has anyone else noticed this problem, and if so how can it be resolved?</p>\r\n<p>TIA</p>",
    "PostedDate": "2009-06-10T05:44:13.523-07:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "210333",
    "ThreadId": "59054",
    "Html": "<p>Just bumping this thread!</p>\r\n<p>Has no one else experienced this?</p>",
    "PostedDate": "2009-07-09T02:34:51.017-07:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "212662",
    "ThreadId": "59054",
    "Html": "<p>I've pretty much given up on the themes, and any hope of support on them -&nbsp;</p>\r\n<p>They are basically unusable at present (major bugs), and there has been zero response r.e. these bugs.</p>\r\n<p>Search for a posting on this discussion group from me on some I've found - which make them useless (IMO).</p>",
    "PostedDate": "2009-07-16T09:21:38.803-07:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "212921",
    "ThreadId": "59054",
    "Html": "<p>I have to agree, I too am disappointed at the lack of any response to bugs. It feels like i have had to write some styles/templates from scratch, infact iv abandoned these themes and created my own. That hasn't resolved the&nbsp;selected tab issue for me. Maybe the MSDN WPF forum can offer more help than here, at least you there you are aknowledged, even if it takes a week or two.&nbsp;</p>",
    "PostedDate": "2009-07-17T01:28:23.297-07:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "213168",
    "ThreadId": "59054",
    "Html": "<p>I hadn't thought of that - posting on the MSDN forum; I may try that. &nbsp;You would think that this would be a good place since this is where the darn things are published!</p>",
    "PostedDate": "2009-07-17T12:22:19.107-07:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  }
]