[
  {
    "Id": "213367",
    "ThreadId": "62846",
    "Html": "<p>Hi all,</p>\r\n<p>Is anyone knows how to use RibbonDialogLauncher in RibbonGroup?</p>\r\n<p>&nbsp;</p>\r\n<p>Best regards,</p>\r\n<p>Basil.</p>",
    "PostedDate": "2009-07-18T05:24:54.347-07:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "213941",
    "ThreadId": "62846",
    "Html": "<p>Hi Basil,</p>\r\n<p>The RibbonDialogLauncher is wired up to the RibbonCommand that you set on your group, so clicking the dialog launcher button on the group will invoke the Execute event on that group's RibbonCommand.</p>\r\n<p>That being said, we will be removing RibbonDialogLauncher from the next preview and likely also from V1, so I would suggest that you use an alternative UI (for example, an additional button in the group which is labeled &quot;More Options...&quot;).&nbsp; The reason that we are removing these APIs is that we recently found out that the Dialog Launcher feature in Office is potentially infringing on a non-Microsoft&nbsp;patent.&nbsp; Office is still involved in litigation, so I'm not sure what the outcome of the dispute will be (e.g., if Office will remove this feature from the next version and/or from the Fluent UI License), but all Microsoft Ribbon implementations are removing APIs for dialog launchers so that developers don't potentially&nbsp;infringe on this patent while using our Ribbon code.&nbsp; At this time we do not have plans to include an alternative feature to replace the dialog launcher, so I would recommend using a different feature (such as an additional button to pop open a dialog, or a contextual tab) in place of the dialog launcher.</p>\r\n<p>Thanks!<br>Samantha</p>",
    "PostedDate": "2009-07-20T12:02:11.5-07:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "563761",
    "ThreadId": "62846",
    "Html": "\r\n<p>Do you have updates about this patent infringements? It seems the feature was not removed from Office 2010. Can you add it back to the RibbonControlsLibrary?</p>\r\n<p>Can you give more references to this potentially patent infringement?</p>\r\n<p>&nbsp;</p>\r\n<p>Thanks,</p>\r\n<p>Splintor</p>\r\n",
    "PostedDate": "2011-02-09T23:15:52.28-08:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "666450",
    "ThreadId": "62846",
    "Html": "<p>Software patents are crap. &nbsp;I just wasted hours trying to figure out how to incorporate this feature that I thought Microsoft let slip out of the release version.</p>\r\n<p><a href=\"http://techcrunch.com/2010/08/07/why-we-need-to-abolish-software-patents/\"><a href=\"http://en.wikipedia.org/wiki/Software_patent_debate\">http://en.wikipedia.org/wiki/Software_patent_debate</a></a></p>",
    "PostedDate": "2011-09-01T12:35:17.77-07:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "703304",
    "ThreadId": "62846",
    "Html": "<p>Any news on this? What's changed in the .Net 4.5 preview of the Ribbon? Has the dialog launcher come back?</p>",
    "PostedDate": "2011-11-25T02:24:46.097-08:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "743699",
    "ThreadId": "62846",
    "Html": "<p>It's not back. Any News?</p>",
    "PostedDate": "2012-02-06T12:37:48.75-08:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  }
]