[
  {
    "Id": "221317",
    "ThreadId": "64987",
    "Html": "<p>Hi,</p>\r\n<p>&nbsp;</p>\r\n<p>I am a blind computer programmer trying out the new datagrid from the wpf toolkit. Is there a way to set the text of the buttons on the datagrid such as add, update, delete, select all, etc. ? I am unable to find any way to add text to a button on the grid. While at runtime, I can use my screen reader to investigate the rendered datagrid and can see that there are buttons using my screen reader spoken to me as &quot;button graphic xxxx&quot;. I'd like to change the caption/text of the buttons to be actual text, not just graphics, &nbsp;so the buttons can be spoken to me. Hopefully I do not need to make template columns to accomplish this and there are actual properties in the datagrid that lets a programmer change the caption of the default datagrid buttons?</p>\r\n<p>&nbsp;</p>\r\n<p>Also, is there a way to tab to the data brid buttons to activate them?</p>\r\n<p>&nbsp;</p>\r\n<p>Finally, are there any built in keyboard shortcuts for add a new row/record? I found f2 for edit and the delete key for deleting a row but cannot find a keystroke to add a new blank row to the datagrid where I can tab through each item in a new blank row and key in the data to add it to the datagrid.</p>\r\n<p>&nbsp;</p>\r\n<p>Thanks!</p>\r\n<p>&nbsp;</p>\r\n<p>/Justin</p>",
    "PostedDate": "2009-08-09T14:11:09.293-07:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "222221",
    "ThreadId": "64987",
    "Html": "<p>Hi Justin,</p>\r\n<p>Could you supply&nbsp;a little more information for us?&nbsp; We tried this out using the Windows 7 screen reader today and weren't seeing the same results you described, so we just want to make sure that we understand the problem and the desired resolution so that we can come up with a recommendation.&nbsp; A few questions we have:</p>\r\n<p>1. Which screen reader are you using?&nbsp; We didn't find that the built in Win7 one read much of anything useful from our DataGrid, so we were wondering if maybe you were using a different application.</p>\r\n<p>2. You mention buttons for Add, Delete, Update, and Select All.&nbsp; Are these buttons that you've added to your application?&nbsp; The reason I ask is that DataGrid does not have built-in UI for most of these operations.&nbsp; Select All does have a button, but it's just the blank header in the upper left corner and does not have any graphics or text built in to it.&nbsp;&nbsp;Deleting rows can be accomplished programmatically or with keyboard shortcuts, but we don't have any buttons on the DataGrid to invoke this operations.&nbsp; Adding new rows or Updating can be accomplished programmatically, but I don't believe we have any shortcuts for those either.</p>\r\n<p>3. Can you explain what you would envision as the best case for how a screen reader would read the DataGrid?&nbsp; For example, should it announce each UI element and then its data, or should it just read the data, etc.?&nbsp; For example, if you had a&nbsp;DataGrid with 3 columns for First, Middle, and&nbsp;Last name information and two items which had content &quot;John Michael Doe&quot; and &quot;Jane Marie Doe&quot;,&nbsp;is &quot;Row 1, Column First Name: John, Column Middle Name: Michael, Column Last Name: Doe.&nbsp; Row 2, Column First Name: Jane, Column Middle Name: Marie, Column Last Name: Doe&quot; the desired output or would something like &quot;DataGrid with columns First Name, Last Name, Middle Name.&nbsp; Row 1, John Michael Doe.&nbsp; Row 2, Jane Marie Doe,&quot; be better?&nbsp; What should it say if, for example, it comes across the header which is enabled to Select All, or a blank &quot;AddNewRow&quot; at the bottom of the grid where you can enter data?&nbsp; We just want to make sure that we understand how you are expecting the DataGrid to work, and if it's not meeting those expectations, how we can fix it.</p>\r\n<p>You should be able to add buttons to your application which are hooked up to&nbsp;DataGrid's events to invoke things like&nbsp;making the&nbsp;blank new row appear or selecting all or deleting the selected rows, and&nbsp;you should be able to tab to these buttons.&nbsp; We do not have a shortcut key for adding a new row, unfortunately, but you should be able to add one by handling the KeyDown event.&nbsp;</p>\r\n<p>Thanks!<br>Samantha</p>",
    "PostedDate": "2009-08-11T14:42:59.207-07:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "222263",
    "ThreadId": "64987",
    "Html": "\r\n<div>Hi Samantha,</div>\r\n<div> </div>\r\n<div>Sorry, my mistake, I thought the datagrid had built \r\nin buttons for add/update/delete on the datagrid itself so please disregard that \r\nmisconception.</div>\r\n<div> </div>\r\n<div>About the screen reader, I'm just programming using \r\nthe built in narrarator.</div>\r\n<div> </div>\r\n<div>The best case scenario is that the screen reader should it announce each UI \r\nelement and then its data.</div>\r\n<div> </div>\r\n<div>For example: &quot;Row 1, Column First Name: John, Column Middle Name: Michael, \r\nColumn Last Name: Doe.  Row 2, Column First Name: Jane, Column Middle Name: \r\nMarie, Column Last Name: Doe&quot;.</div>\r\n<div> </div>\r\n<div>While I have your ear, is there any property on the \r\ndatagrid itself that I can use to tell if it is in read only mode or edit \r\nmode?</div>\r\n<div> </div>\r\n<div>Thanks!</div>\r\n<div><br>Regards,<br>Justin</div>\r\n<blockquote style=\"border-left:#000000 2px solid;padding-left:5px;padding-right:0px;margin-left:5px;margin-right:0px\" dir=ltr>\r\n  <div style=\"font:10pt arial\"> </div>\r\n  <p> </p></blockquote>",
    "PostedDate": "2009-08-11T16:42:11.803-07:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "223058",
    "ThreadId": "64987",
    "Html": "<p>Hi Justin,</p>\r\n<p>Yup, there are a couple different ways you can tell if DataGrid is in edit mode or not.&nbsp; On DataGrid, if you listen for the BeginningEdit event -&nbsp;it will tell you when the DataGrid is about to be put into edit mode.&nbsp; Also, both DataGridRow and DataGridCell&nbsp;have a boolean IsEditing property, so you can also listen for changed in that property.</p>\r\n<p>Thanks!<br>Samantha</p>",
    "PostedDate": "2009-08-13T11:23:27.597-07:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "223064",
    "ThreadId": "64987",
    "Html": "\r\n<div>Hi Samantha,</div>\r\n<div> </div>\r\n<div>Thanks for the reply.</div>\r\n<div> </div>\r\n<div>How can I detect if the datagrid is in read only or \r\nedit mode by using UI automation?</div>\r\n<div> </div>\r\n<div> </div>\r\n<div><br>Regards,<br>Justin</div>\r\n<blockquote style=\"border-left:#000000 2px solid;padding-left:5px;padding-right:0px;margin-left:5px;margin-right:0px\" dir=ltr>\r\n  <div style=\"font:10pt arial\"> </div>\r\n  <p> </p></blockquote>",
    "PostedDate": "2009-08-13T11:47:22.407-07:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "223105",
    "ThreadId": "64987",
    "Html": "<p>Hi Justin,</p>\r\n<p>Unfortunately, &quot;Editable&quot; is not one of the supported properties of Automation.&nbsp; As an ugly workaround,&nbsp;you can try and invoke a DataGridCellItemAutomationPeer&nbsp;- if DataGrid is readonly,&nbsp;the operation will fail and you'll get an InvalidOperationException.</p>\r\n<p><br>Thanks,<br>Samantha</p>",
    "PostedDate": "2009-08-13T13:45:40.297-07:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "223210",
    "ThreadId": "64987",
    "Html": "\r\n<div>HI Samantha,</div>\r\n<div> </div>\r\n<div>How would I invoke this from UIA? All I have is a \r\nIRawElementProviderSimple instance.<br></div>\r\n<div>Thanks for any clarification!</div>\r\n<div><br>Regards,<br>Justin</div>\r\n<blockquote style=\"border-left:#000000 2px solid;padding-left:5px;padding-right:0px;margin-left:5px;margin-right:0px\" dir=ltr>\r\n  <div style=\"font:10pt arial\"> </div>\r\n  <p> </p></blockquote>",
    "PostedDate": "2009-08-13T19:26:51.14-07:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "227601",
    "ThreadId": "64987",
    "Html": "<p>Justin,</p>\r\n<p>Using GridPattern supported by Datagrid you can retrieve a DataGridCell using GetItem method. DataGridCell element's corresponding AutomationPeer supports IValueProvider and IInvokeProvider. You can check IValueProvider.IsReadOnly property or try IInvokeProvider.Invoke method.</p>\r\n<p><a href=\"http://msdn.microsoft.com/en-us/library/ms747211.aspx\">http://msdn.microsoft.com/en-us/library/ms747211.aspx</a>&nbsp;has code for using InvokePattern.</p>\r\n<p>&nbsp;</p>\r\n<p>-Keerthi</p>",
    "PostedDate": "2009-08-25T12:23:43.017-07:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "227907",
    "ThreadId": "64987",
    "Html": "\r\n<div>Hi Keerthi,</div>\r\n<div> </div>\r\n<div>Thank you for the reply.</div>\r\n<div> </div>\r\n<div><span class=906391711-26082009>How do I get at the edit \r\ncontrol embedded in a cell via UIA to obtain its text provider \r\ninterface?</span></div>\r\n<div><span class=906391711-26082009></span> </div>\r\n<div><span class=906391711-26082009>I am using a sample datagrid \r\nthat is editable. However, the editable cells do not contain any edit control, \r\njust static text which do not have a text provider pattern implemented. \r\n</span></div>\r\n<div> </div>\r\n<div>Thanks for any help!</div>\r\n<div> </div>\r\n<div><br>Regards,<br>Justin</div>\r\n<blockquote style=\"border-left:#000000 2px solid;padding-left:5px;padding-right:0px;margin-left:5px;margin-right:0px\" dir=ltr>\r\n  <div style=\"font:10pt arial\">----- Original Message ----- </div>\r\n  <div style=\"font:10pt arial;background:#e4e4e4;font-color:black\"><b>From:</b> \r\n  [email removed] </div>\r\n  <div style=\"font:10pt arial\"><b>To:</b> [email removed] </div>\r\n  <div style=\"font:10pt arial\"><b>Sent:</b> Tuesday, August 25, 2009 3:31 \r\n  PM</div>\r\n  <div style=\"font:10pt arial\"><b>Subject:</b> Re: WPF Datagrid Accessibility \r\n  [wpf:64987]</div>\r\n  <div><br></div>\r\n  \r\n\r\n  <p>From: kedecond</p>\r\n  <div id=ThreadNotificationPostBody>\r\n  <p>Justin,</p>\r\n  <p>Using GridPattern supported by Datagrid you can retrieve a DataGridCell \r\n  using GetItem method. DataGridCell element's corresponding AutomationPeer \r\n  supports IValueProvider and IInvokeProvider. You can check \r\n  IValueProvider.IsReadOnly property or try IInvokeProvider.Invoke method.</p>\r\n  <p><a href=\"http://msdn.microsoft.com/en-us/library/ms747211.aspx\">http://msdn.microsoft.com/en-us/library/ms747211.aspx</a> has \r\n  code for using InvokePattern.</p>\r\n  <p> </p>\r\n  <p>-Keerthi</p></div>\r\n  </blockquote>",
    "PostedDate": "2009-08-26T04:58:47.71-07:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  }
]