[
  {
    "Id": "222676",
    "ThreadId": "65384",
    "Html": "<p>To all:</p>\r\n<p>I wanted to ask about this particular error message I am receiving. It is occuring on an Invalid Operation Exception - 'DeferRefresh' is not allowed during an AddNew or EditItem transaction.</p>\r\n<p>To explain better: My main window contains a list of items. When the user selects an item in the list, they click an &quot;open&quot; button that launches a modal dialog window. This modal dialog window then displays a data grid with info relevant to the list item selected. Ok and Cancel buttons are present for persistence logic and both close the window.</p>\r\n<p>The problem occurs when the window is closed before the DataGrid commits changes to a row. My persistence logic and close window logic works fine, but when I select &quot;open&quot; again from the main window for the same list item, I then get the InvalidOperationException with the message about DeferRefresh not allowed.</p>\r\n<p>What is confusing is that it only seems to occur if one of the fields fails validation. If they all pass validation, it seems that closing the window is enough to cause end edit on the grid... but if one of them fails, like the user types in 3 caharacters for a two-letter state code (ex. CAL instead of CA), the box is outlined red as it should be, and the buttons perform properly... but next time the same item opens the bomb drops.</p>\r\n<p>Any thoughts on this? Is there something I need to do in my button commands to ensure that the datagrid &quot;ends edit&quot; on Ok or Cancel.</p>\r\n<p>The only trick to this situation is this... I am writing in MVVM. So my Ok and Cancel buttons tie to ICommands in the ViewModel, not to code-behind. This means my view model is ignorant of the grid's existence and unable to force EndEdit() in the ICommands.</p>\r\n<p><strong>Is there some other way to make a grid object end its edit from the ViewModel? Or is there a XAML setting I can change to make sure this occurs on lose focus or something?</strong></p>\r\n<p>Thank you very much ahead of time.</p>",
    "PostedDate": "2009-08-12T12:25:16.033-07:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  }
]