[
  {
    "Id": "225169",
    "ThreadId": "66291",
    "Html": "<p>I have a 100 row by 30 column DataGrid that is bound to an ObservableCollection.&nbsp; I notice that it takes about about 350 msec to update the ObservableCollection when the DataGrid is displayed full screen (about 40 rows and 20 coumns on a 1280 x 800 laptop screen).&nbsp; Do other people see the same performance?&nbsp; This seems like a long time to me.<br><br>The same ObservableCollection can be updated in about 20 msec when it is not bound to the DataGrid (or 15x faster than the data bound case).&nbsp; &nbsp;<br><br>The DataGrid uses the built-in DataGridTextColumns.&nbsp; It does not have any fancy stying or custom templates.&nbsp; It has fixed column widths.&nbsp; Varying the Binding Mode (1-way vs 2-way) does NOT seem to make any difference.<br><br>Can anybody recommend how I can improve the performance of my data bound Datagrid? Can it update in closer to 20 msec than 350 msec?<br><br>My DataGrid has:<br>&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp; ScrollViewer.IsDeferredScrollingEnabled=&quot;True&quot;<br>&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp; VirtualizingStackPanel.IsVirtualizing=&quot;True&quot;<br>&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp; VirtualizingStackPanel.VirtualizationMode=&quot;Recycling&quot;<br><br>I am running on a Intel Duo T7250 at 2.0 GHz with 2 GB RAM. Screen is 1280x800.<br>I am using the June 2009 release of the DataGrid with .NET 3.5 SP1.<br><br>I can switch the ItemsSource of the DataGrid between various ObservableCollections (100 rows) to update the DataGrid display in about 80 msec.<br><br>FWIW, these times are virtually unchanged for an ObservableCollection of 1,000 rows. <br>The times are approximately doubled for a DataGrid of 60 columns. <br>This suggests that row virtualization works; but column virtualization does not work yet.&nbsp; This is what I expected based on the release notes.<br><br>Thanks very much for your help,</p>",
    "PostedDate": "2009-08-18T15:42:41.003-07:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "229735",
    "ThreadId": "66291",
    "Html": "<p>Hi,</p>\r\n<p>I tried to post a new discussion about this issue:</p>\r\n<p>http://wpf.codeplex.com/Thread/View.aspx?ThreadId=67598</p>\r\n<p>&nbsp;</p>\r\n<p>&nbsp;</p>",
    "PostedDate": "2009-09-01T08:06:42.35-07:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "229883",
    "ThreadId": "66291",
    "Html": "<p>Hi, I've posted a reply on the thread kawone's linked to.</p>\r\n<p>For your question, you need to specifically enable column virtualization on the DataGrid with the EnableColumnVirtualization DP.</p>",
    "PostedDate": "2009-09-01T13:52:49.717-07:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  }
]