[
  {
    "Id": "225781",
    "ThreadId": "66461",
    "Html": "<p>I tried to create ShortCut keys for Office Ribbon controls like:</p>\r\n<p>&lt;Window.CommandBindings&gt;<br>&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp; &lt;CommandBinding x:Name=&quot;cmdExit&quot; Command=&quot;{x:Static i:ApplicationCommands.exit}&quot;&gt;&lt;/CommandBinding&gt;<br>&nbsp;&nbsp;&nbsp; &lt;/Window.CommandBindings&gt;<br>&nbsp;&nbsp;&nbsp; &lt;Window.InputBindings&gt;<br>&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp; &lt;KeyBinding Command=&quot;{x:Static i:ApplicationCommands.exit}&quot; Gesture=&quot;Ctrl+E&quot;&gt;&lt;/KeyBinding&gt;<br>&nbsp;&nbsp;&nbsp; &lt;/Window.InputBindings&gt;</p>\r\n<p>However, I needed to assign the Binding to the Command for the Ribbon control. However, the Ribbon control Command is already bound to RibbonCommand resource. So, is there any way to bind shortcut keys in Office UI ribbon controls??</p>\r\n<p>As a side question, I last visited the Office UI site probably in November last year. As it was a CTP, I did not pursue it further. This time, when I returned, to my surprise, there was the same CTP. Isn't an upgrade to the CTP planned? More importantly, is there a release date for V1 of the UI. I read CodePlex only that it was to be relased around the middle of this year.</p>",
    "PostedDate": "2009-08-20T02:49:35.69-07:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "227651",
    "ThreadId": "66461",
    "Html": "<p>Hi r_honey,</p>\r\n<p>The scenario you describe above is broken in the current CTP and is actually one of the reasons why we decided to get rid of RibbonCommand and change the Ribbon architecture in the upcoming release.&nbsp; You will be able to do this like you would with other traditional WPF controls in CTP2 and V1, but there is no easy way to achieve this using the current release.</p>\r\n<p>Yes, unfortunately the Ribbon schedule has slipped significantly in light of our commitments to .NET 4.0.&nbsp; We do plan on releasing an CTP2 and V1 within the coming months, but are not able to commit to a date at this time.&nbsp; We were originally hoping to ship CTP2 this summer, but we were not able to achieve that goal since we had obligations for .NET 4.0 which we needed to fulfill.&nbsp; We are actively working on Ribbon, though, and will provide a timeline for releasing the second CTP and V1 as soon as our schedule is stable enough to commit to dates.</p>\r\n<p>Thanks!<br>Samantha</p>",
    "PostedDate": "2009-08-25T13:58:21.657-07:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "227980",
    "ThreadId": "66461",
    "Html": "<p>Thanx for the reply Samantha. I hope for an early release of atleast CTP2 of the Ribbon.</p>",
    "PostedDate": "2009-08-26T08:10:07.247-07:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  }
]