[
  {
    "Id": "230088",
    "ThreadId": "67702",
    "Html": "<p>Hi All,</p>\r\n<p>I am using RibbonDropDownButton in my application. The RibbonDropDownButton is binding with data from a data grid control. The binding working fine. For the RibbonDropDownButton, I have created a RibbonCommand with CanExecute event is handled. The CanExecute event handler is not get fired at any means. I found this issue when I am struggling another issue.</p>\r\n<p>My appication uses TabControl to load data. The Ribbon control will have RibbonTabs according to the context of the Tab Item. We normally show/hide the RibbonTabs. When the application is loaded the RibbonDropDownButton is enabled with the items loaded. When I go the next tab (Created when the create button is clicked) and come back, the RibbonDropDownButton gets disabled. It gets enabled when I click the content of that RibbonTab. I removed the CommandBinding used to that RibbonDropDownButton and tried, it worked perfectly without any image/icon on it. This might be a bug. Can anyone comment on this?</p>\r\n<p>Can we add image/icon to a IRibbon control without using RibbonCommand?</p>",
    "PostedDate": "2009-09-02T02:16:06.233-07:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "230626",
    "ThreadId": "67702",
    "Html": "<p>Can anyone give a solution for the above issues?</p>\r\n<p>&nbsp;</p>",
    "PostedDate": "2009-09-03T04:23:51.903-07:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "469328",
    "ThreadId": "67702",
    "Html": "<p>i'm having the same issue.</p>\r\n<p>RibbonDropDownButton CanExecuteCommand at certain scenario won't triggered, while other type like togglebutton are still working fine.</p>\r\n<p>i dunno what really caused this, the only thing i can observed is after some ICollectionView.refresh on other things/parts, and ZIndex manipulation, the RibbonDropDownButton CanExecuteCommand then died.</p>\r\n<p>but if i click on the ribbon bar/tab, it fired again</p>\r\n<p>I tried the CommandManager.InvalidRequerySuggested() still to no avail</p>\r\n<p>still seeking resolution</p>",
    "PostedDate": "2010-07-19T19:52:46.313-07:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  }
]