[
  {
    "Id": "230678",
    "ThreadId": "67869",
    "Html": "<p>The control template for the Calendar control appears to have a bug, which I have reported on the Issue Tracker. Now I need to find a workaround.</p>\r\n<p>The bug is simple to reproduce. In Blend, create a window and add a Calendar control to it. Next, create a copy of the Calendar control template by right-clicking the Calendar and selecting <em>Edit Template &gt; Edit a Copy</em> from the context menu. A <em>PART_CalendarItem</em> will appear below the control in the <em>Objects and Timeline</em> window.&nbsp;Finally, create a copy of the <em>PART_CalendarItem</em> template by right-clicking it and again selecting <em>Edit Template &gt; Edit a Copy</em> from the context menu.</p>\r\n<p>At this point, you have a Calendar control styled to an unmodified Calendar control template. Hit F5 to run the project, and move the cursor over the month name or either navigation arrow. The project will crash, with the following error:</p>\r\n<pre>'TextColor' name cannot be found in the name scope of 'System.Windows.Controls.Grid'.</pre>\r\n<p>If you look at the XAML for the control template, you can see the problem. In the <em>HeaderButtonTemplate</em> section, around line 80, you will see the following:</p>\r\n<div style=\"color:Black;background-color:White\">\r\n<pre><span style=\"color:Blue\">&lt;</span><span style=\"color:#A31515\">ColorAnimation</span> <span style=\"color:Red\">Duration</span><span style=\"color:Blue\">=</span><span style=\"color:Black\">&quot;</span><span style=\"color:Blue\">00:00:00</span><span style=\"color:Black\">&quot;</span> <span style=\"color:Red\">Storyboard.TargetName</span><span style=\"color:Blue\">=</span><span style=\"color:Black\">&quot;</span><span style=\"color:Blue\">TextColor</span><span style=\"color:Black\">&quot;</span> <span style=\"color:Red\">Storyboard.TargetProperty</span><span style=\"color:Blue\">=</span><span style=\"color:Black\">&quot;</span><span style=\"color:Blue\">Color</span><span style=\"color:Black\">&quot;</span> <span style=\"color:Red\">To</span><span style=\"color:Blue\">=</span><span style=\"color:Black\">&quot;</span><span style=\"color:Blue\">#FF73A9D8</span><span style=\"color:Black\">&quot;</span><span style=\"color:Blue\">/&gt;</span>\r\n</pre>\r\n</div>\r\n<p>The line is supposed to change the text color of the Month name when you mouse over it, to indicate that it is, in fact, a button. The problem appears to be that the <em>TextColor</em> assignment applies to the grid that contains the VisualStateManager, rather than the text for the HeaderButton. The same problem occurs in the templates for the <em>Previous</em> and <em>Next</em> buttons at the top of the calendar.</p>\r\n<p>So, here's my question: How do I modify the Calendar control template to eliminate the problem? I know I can comment-out or remove the offending statements. But if I do, I lose the mouse-over effect on the calendar buttons, and I would really like to keep those. Can you suggest how to fix the problem, to the mouse-over effect works as it should? Thanks for your help.</p>\r\n<p>&nbsp;</p>",
    "PostedDate": "2009-09-03T06:58:29.347-07:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "241153",
    "ThreadId": "67869",
    "Html": "<p>I know you were looking for help for this a month ago, but I wanted to post the explanation for posterity. I believe this is your StackOverflow question, I did my best to answer:</p>\r\n<p><a href=\"http://stackoverflow.com/questions/1370581/wpf-toolkit-bug-in-control-template/\">http://stackoverflow.com/questions/1370581/wpf-toolkit-bug-in-control-template/</a></p>",
    "PostedDate": "2009-10-01T22:00:20.44-07:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "241271",
    "ThreadId": "67869",
    "Html": "<p>Thanks--Accepted and upvoted on StackOverflow!</p>",
    "PostedDate": "2009-10-02T06:07:46.047-07:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  }
]