[
  {
    "Id": "235096",
    "ThreadId": "69097",
    "Html": "<p>Is there a way to define datagrid columns using DataTemplate?</p>",
    "PostedDate": "2009-09-16T04:33:27.193-07:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "236226",
    "ThreadId": "69097",
    "Html": "<p>Hi bnovicewpf,</p>\r\n<p>I don't believe that there's a way to do this.&nbsp; What is your scenario, maybe there's another way to accomplish it?</p>\r\n<p>Thanks,</p>\r\n<p>Saied K.</p>",
    "PostedDate": "2009-09-18T13:49:07.153-07:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "236230",
    "ThreadId": "69097",
    "Html": "<p>The way it works with ListView is that we can set ItemsTemplate with the DataTemplate which contains Grid and then column information.</p>\r\n<p>Same doesn't work with DataGrid though.</p>\r\n<p>The idea is to intialize the datagrid without knowing it is a datagrid (from seperate module)</p>",
    "PostedDate": "2009-09-18T13:56:11.107-07:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "245945",
    "ThreadId": "69097",
    "Html": "<p>The idea was to make datagrid control as dumb as possible. Adhering to MVP (Model-View-Presenter) I wanted the presenter to specify the column definition for the view. Another objective was to allow user to bind same Model data to different views. Thus the way I achieved for other collection controls ListBox, Listview, etc was to specify the control definition as DataTemplate and set it to ItemTemplate f the control.&nbsp;</p>\r\n<p>But doing the same with WPF datagrid was not working, thus&nbsp;I created a custom DataGrid control inheriting from WPF DataGrid and hide &quot;Columns&quot; (type: ObservableCollection&lt;DataGridColumn&gt;) by creating dependency property of the same. Now the presenter specifies the DataGridColumn collection and binds to &quot;Columns&quot; property of the custom control (view). The view then manually add's the columns to DataGrid control.</p>\r\n<p>I am very eager to know whether the approach I have followed is correct or not.</p>\r\n<p>Is there another better/nice/optimum way to achieve the above?</p>\r\n<p>&nbsp;</p>\r\n<p>&nbsp;</p>",
    "PostedDate": "2009-10-15T02:55:34.67-07:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  }
]