[
  {
    "Id": "241474",
    "ThreadId": "70857",
    "Html": "<p>Hello all,</p>\r\n<p style=\"padding-left:30px\">I don't want to call this a bug, so I am posting this as a question of &quot;How it was intended to be use&quot;.&nbsp; I have a DatePicker with a binding set for the SelectedDate.&nbsp;&nbsp;In my case the datasource has a valid default value.&nbsp; Here is the issue I am comming up with.&nbsp; At run time, the SelectDate is updated from the source automatically, then the XAML is parsed in where the BlackoutDates property collection is updated.</p>\r\n<p style=\"padding-left:30px\">Here is my issue/question:&nbsp; The&nbsp;CalendarBlackoutDatesCollection.InsertItem() method throws an exception by design because the SelectedDate value falls within the CalendarDateRange'es specified in the XAML.&nbsp;</p>\r\n<p style=\"padding-left:30px\">Can someone please explain&nbsp;why the code was designed this way (thinking that perhaps I don't understand the propery usage of the BlackoutDates property?&nbsp; Or maybe this is a result of someone forgot to negate the &quot;if&quot; block just before the ArgumentOutOfRangeException was thrown?</p>\r\n<p style=\"padding-left:30px\">- Rashad Rivera<br>&nbsp;&nbsp; omegusprime.com</p>",
    "PostedDate": "2009-10-02T13:02:37.93-07:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "414680",
    "ThreadId": "70857",
    "Html": "<p>I've run into this too.</p>",
    "PostedDate": "2010-03-05T09:43:30.007-08:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "414816",
    "ThreadId": "70857",
    "Html": "<p>qntmfred,</p>\r\n<p style=\"padding-left:30px\">I have since given up on the use of this control.&nbsp; I could not get it to work so I went with the Telerik WPF control library (see <a href=\"http://www.telerik.com\">www.telerik.com</a> for more details).&nbsp; While your waiting for a reply (not that I think one is coming), you can use Telerik's demo assemblies to see if it meets your needs.&nbsp;</p>\r\n<p>- Rashad Rivera<br>&nbsp; omegusprime.com</p>",
    "PostedDate": "2010-03-05T15:57:00.45-08:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  }
]