[
  {
    "Id": "242508",
    "ThreadId": "71107",
    "Html": "<p>Hello</p>\r\n<p>I have a simple chart, that I bind data to. The result is a nice graph.</p>\r\n<p>I want to reuse the usercontrol with the chart when printing. In some cases, the usercontrol with the chart is not shown when printed. The result is that the graph-line is not shown. The rest of the chart is shown, but not the graph-line.<br>I assume the reason for this is, that the chart is&nbsp;not rendered&nbsp;before it is&nbsp;shown. How do I force it to render programmatically?</p>\r\n<p>&nbsp;</p>",
    "PostedDate": "2009-10-06T04:41:21.023-07:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "242717",
    "ThreadId": "71107",
    "Html": "<p>Hi,</p>\r\n<p>I have the same problem. Printing to XPS writer shows everything perfectly, but when printing on a &quot;real&quot; printer, the series is not visible there. Even rendering it to a bitmap doesn't work for me. It has the same effect.</p>\r\n<p>I hope someone can help here...</p>",
    "PostedDate": "2009-10-06T13:55:32.81-07:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "243273",
    "ThreadId": "71107",
    "Html": "<p>Hello,</p>\r\n<p>I also have the same problem. Showing the chart is not a problem, but no series when printing. It would be nice to have some help.</p>\r\n<p>Thanks.</p>",
    "PostedDate": "2009-10-07T23:22:58.743-07:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "441765",
    "ThreadId": "71107",
    "Html": "<p>I am having the same issue with exporting to XPS, Any Ideas?</p>",
    "PostedDate": "2010-05-11T19:10:19.02-07:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "441904",
    "ThreadId": "71107",
    "Html": "Does that problem also occur when you have already shown the chart in the GUI?\r\nI think there already a few discussions in the forum which explain that the little animation which makes the line fade-in causes that the line is not yet shown when you simply render it.\r\nA solution is to override the style to a version without animation.\r\n\r\nOff-Topic: Does anybody know why this forum sometimes completly ignores all my formatting?",
    "PostedDate": "2010-05-12T01:58:14.593-07:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "441966",
    "ThreadId": "71107",
    "Html": "<blockquote style=\"border:solid .1em #ccc;font-style:italic;margin:.25em 1em 0 1em;padding:0 .25em 0 .25em\"><strong>ernii23 wrote:</strong><br>Does that problem also occur when you have already shown the chart in the GUI? I think there already a few discussions in the forum which explain that the little animation which makes the line fade-in causes that the line is not yet shown when you simply render it. A solution is to override the style to a version without animation.  Off-Topic: Does anybody know why this forum sometimes completly ignores all my formatting?</blockquote>\r\n<p>Hi ernii,&nbsp;<br><br>Thanks for that, yes upon investigation it is caused by the &quot;fade-in feature&quot; of series; overriding the behaviour in the VSM in the control template fixes it...... mostly.... I am still having issues with this for the new StackedSeries feature, it is still not displaying the series even though I have cancelled the initial &quot;fade-in&quot;. If I switch the series to Column it displays correctly.<br><br>Any ideas would be greatly appreciated.&nbsp;</p>",
    "PostedDate": "2010-05-12T03:42:01.653-07:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "471660",
    "ThreadId": "71107",
    "Html": "Some problems over here. I already have a datapoint style that sets the template. But with line series I only see the datapoints, not the line itself. I thought (and still think) it is the StaggeredStateChange in DataPointSeries that always fires up a storyboard. But it is private method.\r\n\r\nWhen I plot the chart to a seperate window and then save it: all is well.\r\n\r\nI created this workaround, not really nice, but it works:\r\n            // create copy of chart.\r\n            Chart dupe = chart.DuplicateChart(model.chartSettings);\r\n            dupe.Width = 700;\r\n            dupe.Height = 500;\r\n            Window win = new Window();\r\n            win.SizeToContent = System.Windows.SizeToContent.WidthAndHeight;\r\n            win.Content = dupe;\r\n            win.ShowInTaskbar = false;\r\n            win.WindowStyle = System.Windows.WindowStyle.None;\r\n            win.AllowsTransparency = true;\r\n            win.Opacity = 0;\r\n            win.Owner = this;\r\n            win.Show();\r\n            this.Focus();\r\n            .....\r\n            Copy to clipboard, save, print...\r\n\r\n\r\n",
    "PostedDate": "2010-07-23T08:28:50.4-07:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  }
]