[
  {
    "Id": "249834",
    "ThreadId": "73126",
    "Html": "<p>When can we expect the next release of this project? It has been 4 months since the previous release and it contains some nasty bugs, even in the &quot;Stable&quot; quality band. Now that .NET 4 beta 2 is out, I think you can share some of the fixes you surely did for that release.</p>\r\n<p>Most annoying to me is this calendar bug: when you drag the mouse and let the mouse button go up outside the calendar, the selection seems to be update, but in fact it does not! This is a critical bug, because it can lead to data corruption for the unwary user. I've reported it there: <a href=\"http://wpf.codeplex.com/WorkItem/View.aspx?WorkItemId=10290\">http://wpf.codeplex.com/WorkItem/View.aspx?WorkItemId=10290</a>&nbsp;on 9th July, and I would really like to get some fix.</p>\r\n<p>I've built an application for my customer using this stuff and now I am starting to regret it, considering&nbsp;the poor support MS puts into this project. Please do not make us wait for the .NET 4 release in march. People are building WPF 3.5 apps <em>today</em>, and we would love to be able to do so.</p>\r\n<p>Because of a similar previous experience with your datagrid, I bought one competitor product, and I must say I'm extremely pleased by the feel and features of that grid, much better than the one MS &quot;builds&quot;. Maybe I should have done the same for the datepicker :-(</p>",
    "PostedDate": "2009-10-26T10:27:26.713-07:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "250692",
    "ThreadId": "73126",
    "Html": "<p>Hi,</p>\r\n<p>I also want to know the next release of the Toolkit. I have ported my problem in VS2010. I see that the behaviour of the DataGrid is different from the latest toolkit. Any one know when will have a new release of the Toolkit?</p>",
    "PostedDate": "2009-10-28T07:44:39.38-07:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "254969",
    "ThreadId": "73126",
    "Html": "<p>Does anyone know if there will be a new release of the toolkit?&nbsp; And if so, when?</p>",
    "PostedDate": "2009-11-09T02:02:01.653-08:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "255039",
    "ThreadId": "73126",
    "Html": "<p>I agree&nbsp;and believe MS should give us an update on this toolkit and/or some type of WPF roadmap.&nbsp; I think MS has been busy and did a good job on VS2010B2 and .NET4B2 release, but now&nbsp;is the time to give us some info on what's next.&nbsp;</p>\r\n<p>What happen to the customer feedback and communication MS is saying it is trying to work on?&nbsp; Please, please, please give us an update on toolkit and the following topics....&nbsp;</p>\r\n<p>Bag O' Tricks and/or new controls.&nbsp;&nbsp; How does this compare and fit with Silverlight Toolkit release?</p>\r\n<p>M-V-VM Templates, Walkthroughs, Documentation.</p>\r\n<p>WPF Ribbon.</p>\r\n<p>MEF Templates, Walkthroughs, Documentation.</p>",
    "PostedDate": "2009-11-09T05:45:55.873-08:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  }
]