[
  {
    "Id": "277148",
    "ThreadId": "80827",
    "Html": "<p>I am not able to resolve how to build WPFToolkit from sources.&nbsp; The two problematic projects are &quot;Controls.DataVisualization.Toolkit.Design&quot; and &quot;Controls.DataVisualization.Toolkit.Expression.Design&quot;.</p>\r\n<p>Both require adding a reference to Microsoft.Windows.Design to resolve most of the errors.&nbsp; Why is this not in the project?</p>\r\n<p>Once this is done, both projects report three errors relating to missing definitions for &quot;ProvideMetadata&quot;, &quot;IProvideAttributeTable&quot; and &quot;ProvideMetadataAttribute&quot;.</p>\r\n<p>I'm stumped?&nbsp; What's the fix?</p>\r\n<p>Thanks in advance.</p>\r\n<p>&nbsp;</p>",
    "PostedDate": "2010-01-14T07:12:29.257-08:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "277387",
    "ThreadId": "80827",
    "Html": "<p>BTW you can just build <strong>WPFToolkit</strong>&nbsp;and use the resulting assembly, that is, strictly speaking, you don't need the projects that fail.</p>\r\n<p>I was able to build just that (from the latest source) and it worked - I made some code changes and the resulting dll was effective.</p>",
    "PostedDate": "2010-01-14T16:32:52.463-08:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "277753",
    "ThreadId": "80827",
    "Html": "<p>Yes, I have a working version of the WPFToolkit and can use it as needed.&nbsp; The bits that are not building prohibit the prospect of making changes to the way design time features might work.&nbsp; And before I can even consider making those kind of changes I need the existing designer&nbsp;code to build.</p>\r\n<p>So the questions stands, how does one build the two projects mentioned above?</p>\r\n<p>There are a couple old&nbsp;threads that make reference to beta Expression Blend assemblies.&nbsp; Now that release versions are out, how are these used.&nbsp; They do not appear to be necessary.&nbsp; At least the assemblies I've attempted to link to do not resolve the above issue.</p>\r\n<p>It seems like only Microsoft employees know how to build the WPFToolkit, or have the needed components.</p>\r\n<p>&nbsp;</p>",
    "PostedDate": "2010-01-15T14:31:19.733-08:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "280672",
    "ThreadId": "80827",
    "Html": "<p>Has anyone looked into this?&nbsp; What are the differences between the&nbsp;&quot;Toolkit-development&quot; and &quot;Toolkit-release&quot; builds&nbsp; (are there notes about this anywhere)?&nbsp;&nbsp;Are the build options such as&nbsp;tweening support documented anywhere?&nbsp; Also, have a look at my remarks regarding the WPF Ribbon control.</p>\r\n<p>&nbsp;</p>",
    "PostedDate": "2010-01-22T10:44:03.393-08:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "280798",
    "ThreadId": "80827",
    "Html": "<p>Hi Noemata,</p>\r\n<p>The following information from the Toolkit homepage may be helpful to you:</p>\r\n<p><strong>Note:</strong> The source code solution for the Chart Controls <em>design time</em> will only build if you have both Expression Blend and Visual Studio (with the Visual Studio Designer for WPF) installed. This is because the Chart controls are dependent on some design time assemblies included with those programs. More info is available <a href=\"http://blogs.msdn.com/delay/archive/2009/06/25/wpf-charting-it-s-official-june-2009-release-of-the-wpf-toolkit-is-now-available.aspx\">here</a>.</p>\r\n<p>With respect to the two&nbsp;source branches, toolkit-development is where we post incremental changes and bug fixes that we haven't yet rolled up into a formal release.&nbsp; That way you can get fixes you are counting on as soon as possible.&nbsp; The source code in the toolkit-release branch is the exact source of our most recent toolkit release.</p>\r\n<p>I hope that helps,</p>\r\n<p>Alexis</p>\r\n<p>&nbsp;</p>",
    "PostedDate": "2010-01-22T16:45:12.927-08:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "281384",
    "ThreadId": "80827",
    "Html": "<p>Hi Alexis,</p>\r\n<p>Thank you for the clarifications. &nbsp;It would be helpful to have a change.log file spelling out the updates/fixes for the toolkit-development branch.</p>\r\n<p>Noemata</p>",
    "PostedDate": "2010-01-25T05:57:14.553-08:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  }
]