[
  {
    "Id": "280378",
    "ThreadId": "81655",
    "Html": "<p>Hi</p>\r\n<p>I have a datagrid with 3 group descriptions. First and Second groups are not expanded, but the third one is expanded.</p>\r\n<p>Whenever there is one item in&nbsp;the second level&nbsp;group and the thrid level group&nbsp;and I click on an editable cell and click away from it, the second level group collapses.</p>\r\n<p>This happens from the fact that the edited row is being removed and re added.</p>\r\n<p>I have been trying to solve this for the past two weeks. Any help will be very much appreciated.</p>\r\n<p>&nbsp;</p>\r\n<p>Thanks</p>\r\n<p>Angelo</p>\r\n<p>&nbsp;</p>",
    "PostedDate": "2010-01-21T21:35:04.807-08:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "283248",
    "ThreadId": "81655",
    "Html": "<p>Hi,</p>\r\n<p>Can you please explain the scenario in bit more detail?</p>\r\n<p>Have you set the OrderDescription ?</p>\r\n<p>Regards,</p>\r\n<p>B</p>",
    "PostedDate": "2010-01-29T02:16:28.773-08:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "284076",
    "ThreadId": "81655",
    "Html": "<p>Hi</p>\r\n<p>I have three groups. First two are&nbsp;collapsed&nbsp;and the third one is expanded. If I have only one leaf level item in the second group, that is there is only one group under&nbsp;that particular second level group and that third group also has only one item, then editing a cell and moving away from it to click on another cell will collapse the second group.</p>\r\n<p>My findings tell me&nbsp;that&nbsp;this happens because that particular item is being removed from the collectionview and added again (found this&nbsp;by creating a collectionchanged even and it gets fired twice one - to add and then two - to remove it), may be because it's trying to re-group the collection.</p>\r\n<p>&nbsp;</p>\r\n<p>Thanks</p>",
    "PostedDate": "2010-01-31T16:22:56.937-08:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  }
]