{
  "WorkItem": {
    "AffectedComponent": {
      "Name": "",
      "DisplayName": ""
    },
    "ClosedComment": "",
    "ClosedDate": null,
    "CommentCount": 0,
    "Custom": null,
    "Description": "When one creates a data grid with an empty, grouped collection and a non-null group style, the columns of the grid will appear with a width of 20 (the minimum value) regardless of the amount of space available in the data grid.  I've investigated the issue, and it seems that this occurs because the GetViewportWidth method, which is used to calculate the available space for the columns, uses the width of the scroll content presenter or internal items host to determine the amount of available space.  However, these controls are \"found\" by the DataGridRowsPresenter searching up it's visual ancestors.  However, if a GroupStyle is being used and there are no groups because the collection is empty, then there is no DataGridRowsPresenter present and the GetViewportWidth method is unable to find the either control and returns an available space of 0.  In that case, each column is given the minimum width of 20, and can't even be manually resized until at least one item is added to the collection.\n \nNote that this problem occurs only with predefined columns, as autogenerated columns aren't created until an item is added to the grid.",
    "LastUpdatedDate": "2013-02-21T18:41:04.067-08:00",
    "PlannedForRelease": "",
    "ReleaseVisibleToPublic": false,
    "Priority": {
      "Name": "Low",
      "Severity": 50,
      "Id": 1
    },
    "ProjectName": "wpf",
    "ReportedDate": "2009-07-29T09:02:01.233-07:00",
    "Status": {
      "Name": "Proposed",
      "Id": 1
    },
    "ReasonClosed": {
      "Name": "Unassigned"
    },
    "Summary": "Column size not calculated correctly in an empty and grouped data grid",
    "Type": {
      "Name": "Issue",
      "Id": 3
    },
    "VoteCount": 1,
    "Id": 10367
  },
  "FileAttachments": [
    {
      "FileId": 3228,
      "FileName": "GroupedDataGridColumnWidthBugDemo.zip",
      "DownloadUrl": ".\\3228"
    }
  ],
  "Comments": []
}