{
  "WorkItem": {
    "AffectedComponent": {
      "Name": "",
      "DisplayName": ""
    },
    "ClosedComment": "Closed - Duplicate of 9490",
    "ClosedDate": "2009-03-23T10:42:57.05-07:00",
    "CommentCount": 0,
    "Custom": null,
    "Description": "The Watermark property of DatePickerTextBox is internal, although it is designed to be used in ControlTemplate.\n \nIn order to create a custom 'theme' for DatePicker control a developer now has to resort to other means to implement that feature. That easily could be triggers on SelectedDateTime or Text properties, but then the question is why that property is there in the first place.\n \nAdditionally, the Watermark property already behaves weird. Here is a scenario:\n \nSelect a data using dropdown. Click on the textbox, select all text and press delete. The text instantly changes to 'Show Calendar' which is completely irrelevant to the user action: there is neither need nor intention to Show Calendar in the scenario, neither there is any analogous behaviour in existing DatePicker controls in Windows.\n \n \nThere seems to be no need for DatePickerTextBox control at all, because there is no particular behaviour that could have been incapsulated there.\nWatermark text could and probably should be implemented as part of parent DatePicker control, because both Text and SelectedDate should be used in the decision.",
    "LastUpdatedDate": "2013-05-16T05:31:07.96-07:00",
    "PlannedForRelease": "",
    "ReleaseVisibleToPublic": false,
    "Priority": {
      "Name": "Low",
      "Severity": 50,
      "Id": 1
    },
    "ProjectName": "wpf",
    "ReportedDate": "2009-03-23T06:33:33.257-07:00",
    "Status": {
      "Name": "Closed",
      "Id": 4
    },
    "ReasonClosed": {
      "Name": "Unassigned"
    },
    "Summary": "DatePickerTextBox's Watermark property is internal, making styling difficult",
    "Type": {
      "Name": "Issue",
      "Id": 3
    },
    "VoteCount": 1,
    "Id": 9584
  },
  "FileAttachments": [],
  "Comments": [
    {
      "Message": "Thanks for reporting this issue.  We agree that this is a bug and will fix it in a future release.  This issue has already been reported in another Issue thread, so I'm closing this one as a duplicate.  Thanks!",
      "PostedDate": "2009-03-23T10:42:42.597-07:00",
      "Id": -2147483648
    },
    {
      "Message": "",
      "PostedDate": "2009-03-23T10:42:57.05-07:00",
      "Id": -2147483648
    },
    {
      "Message": "",
      "PostedDate": "2013-02-21T18:41:25.117-08:00",
      "Id": -2147483648
    },
    {
      "Message": "",
      "PostedDate": "2013-05-16T05:31:07.96-07:00",
      "Id": -2147483648
    }
  ]
}