{
  "WorkItem": {
    "AffectedComponent": {
      "Name": "",
      "DisplayName": ""
    },
    "ClosedComment": "",
    "ClosedDate": null,
    "CommentCount": 0,
    "Custom": null,
    "Description": "Please see thread http://wpf.codeplex.com/Thread/View.aspx?ThreadId=61706\n \nPlease note that the original description was erroneous; the problems are being experienced when setting a column's width to *, not when setting it to Auto as previously stated. Setting the width to * is required to prevent a blank column being added at the end of the DataGrid. Although it may seem superfluous, the StackPanel is required in our project as the UserControl atually consists of two DataGrids, not one.\n \nPlease also note the behaviour that occurs when un-commenting the code under \"Un-comment me 1\".\n \nThe disappearing column headers occurs when setting the column's width to auto (\"Un-comment me 2\"), and only if the HeadersVisibility is set to Column. This is a moot point as we do not actually want to set it to auto, but I have included it as it may still be of interest to you.\n \nOne additional question arises from this: What is the \"correct\" method of setting the width to * in code-behind? The DataGridColumn.Width.IsStar property is read-only, whilst DataGridLength contains no option for *; the only method I have found is the convoluted method used in the sample project, although this is almost certainly wrong! Or is the intention that * should not be set after the DataGrid is initialised?",
    "LastUpdatedDate": "2013-02-21T18:41:06.49-08:00",
    "PlannedForRelease": "",
    "ReleaseVisibleToPublic": false,
    "Priority": {
      "Name": "Low",
      "Severity": 50,
      "Id": 1
    },
    "ProjectName": "wpf",
    "ReportedDate": "2009-07-08T03:55:07.59-07:00",
    "Status": {
      "Name": "Proposed",
      "Id": 1
    },
    "ReasonClosed": {
      "Name": "Unassigned"
    },
    "Summary": "Column Width set to *",
    "Type": {
      "Name": "Issue",
      "Id": 3
    },
    "VoteCount": 1,
    "Id": 10277
  },
  "FileAttachments": [
    {
      "FileId": 3185,
      "FileName": "ColumnWidthExample.zip",
      "DownloadUrl": ".\\3185"
    }
  ],
  "Comments": [
    {
      "Message": "Additionally on the subject of the column headers disappearing, note that if you set both columns (in XAML) to a fixed width it will cause the headers to disappear (again, only on the DataGrid on the first Tab), even if all the code for generating additional columns is commented out. Totally bizzare!",
      "PostedDate": "2009-07-08T04:26:57.34-07:00",
      "Id": -2147483648
    },
    {
      "Message": "",
      "PostedDate": "2013-02-21T18:41:06.49-08:00",
      "Id": -2147483648
    }
  ]
}