{
  "WorkItem": {
    "AffectedComponent": {
      "Name": "",
      "DisplayName": ""
    },
    "ClosedComment": "",
    "ClosedDate": null,
    "CommentCount": 0,
    "Custom": null,
    "Description": "Hi Code Plex Community,\n \nI am using WPF Tool Kit February 2010 Version. \n \nI have made the Data Grid AllowAutoGenerate Columns Property to False, and providing my own Set of Column Collection. When the Grid is shown at the run time it is showing the Grid with an Extra Column Behind the Columns i have configured.\n \nI could not remove or Resize the Column, and the column occupies the entire with of the Grid. Because of it, i am not getting any empty space after all my columns finishes.\n \nEg : Consider my Grid Width = 100 Pixels. I am setting two columns (Name (20 Pixels Width) , Age (10 Pixels Width). So the remaining 70 pixels should become empty right ? instead it is showing that extra column for the entire 100 Pixels.  Another issue is, the column has a Header Text, which is showing the Currently bound Data Source Name (eg . DataSet, Collection or some Entity if we bound).\n \nI have herewith attached a screen shot for the same.\n \nPlease all the code plex developers, can you guide me / fix this issue ASAP. It is producing lots of issues with our Customer.\n \nThanks in Advance\n \nBest Regards,\nGopi V",
    "LastUpdatedDate": "2013-02-21T18:40:20.28-08:00",
    "PlannedForRelease": "",
    "ReleaseVisibleToPublic": false,
    "Priority": {
      "Name": "Low",
      "Severity": 50,
      "Id": 1
    },
    "ProjectName": "wpf",
    "ReportedDate": "2010-11-03T09:44:57.63-07:00",
    "Status": {
      "Name": "Proposed",
      "Id": 1
    },
    "ReasonClosed": {
      "Name": "Unassigned"
    },
    "Summary": "Data Grid Adding a Default Column Behind the Actual Columns with the Bound Data Source Type  Name",
    "Type": {
      "Name": "Issue",
      "Id": 3
    },
    "VoteCount": 2,
    "Id": 14602
  },
  "FileAttachments": [
    {
      "FileId": 5094,
      "FileName": "Grid Issue.bmp",
      "DownloadUrl": ".\\5094"
    }
  ],
  "Comments": []
}