{
  "WorkItem": {
    "AffectedComponent": {
      "Name": "",
      "DisplayName": ""
    },
    "ClosedComment": "It looks like this was fixed in more recent versions of the toolkit.",
    "ClosedDate": "2009-03-24T12:38:48.09-07:00",
    "CommentCount": 0,
    "Custom": null,
    "Description": "DatePicker with the SelectedDateFormat=\"DatePickerFormat.Short\" is not working to display only date, it shows along the \"12:00:00 AM\".\n \nFollowing code changes are done to fix the issue.\nFile: WPFToolkit\\DatePicker\\Microsoft\\Windows\\Controls\\DatePicker.cs\nMethod: SetSelectedDate() at Line Number: 1090\n \nCode To Change:\n-------------------------------------\nif (selectedDate == s)\n{\n    return;\n}\n-------------------------------------\nNew Code:\n-------------------------------------\nif (selectedDate == s)\n{\n    return;\n}\nelse\n{\n    s = selectedDate;\n}\n-------------------------------------\n \nProject participats are requested to update the source at CodePlex.\n \nthanks.",
    "LastUpdatedDate": "2013-05-16T05:31:09.713-07:00",
    "PlannedForRelease": "",
    "ReleaseVisibleToPublic": false,
    "Priority": {
      "Name": "Low",
      "Severity": 50,
      "Id": 1
    },
    "ProjectName": "wpf",
    "ReportedDate": "2009-03-03T11:41:37.71-08:00",
    "Status": {
      "Name": "Closed",
      "Id": 4
    },
    "ReasonClosed": {
      "Name": "Unassigned"
    },
    "Summary": "DatePickerFormat.Short fix",
    "Type": {
      "Name": "Issue",
      "Id": 3
    },
    "VoteCount": 1,
    "Id": 9409
  },
  "FileAttachments": [],
  "Comments": [
    {
      "Message": "jitudavda, I was not able to reproduce the problem programatically or through xaml. Can you post a simple repro of the issue?\r\n\r\nThanks,\r\nEric Fabricant, MSFT",
      "PostedDate": "2009-03-03T14:24:20.023-08:00",
      "Id": -2147483648
    },
    {
      "Message": "<toolkit:DatePicker  SelectedDate=\"{Binding Path=CertificateDate, Mode=TwoWay}\"  SelectedDateFormat=\"Short\" />\r\n\r\nThis is the xaml markup used. \r\nWithout the above fix, DatePicker displays the date appropriatly while loading. But when you select date using Calender, it is displaying the full date instead of Short date.\r\n",
      "PostedDate": "2009-03-04T07:22:36.54-08:00",
      "Id": -2147483648
    },
    {
      "Message": "The DatePicker's default SelectedDateFormat should be short... so this would imply that the its default isn't working properly.  If you remove your Binding on SelectedDate and remove your explicit use of the Short DatePickerFormat, are your SelectedDates displaying a time? Phrased differently, if you use <toolkit: DatePicker/>, does your problem persist?\r\n\r\n-Eric Fabricant, MSFT",
      "PostedDate": "2009-03-04T11:59:29.923-08:00",
      "Id": -2147483648
    },
    {
      "Message": "Hi Eric,\r\n\r\nUsing the DatePicker without binding, works fine as expected. Even Adding the SelectedDateFormat attribute works fine.\r\nThis is happening only while adding Binding to DatePicker. \r\n\r\nLet me know if you want me to test anything further. currently the fix I did works fine for me in binding.\r\n",
      "PostedDate": "2009-03-10T09:19:51.62-07:00",
      "Id": -2147483648
    },
    {
      "Message": "Hi Eric,\r\n\r\nAfter some test I found that binding is also not an issue. I created a test project and use objectdatasource to binding the datepicker. It worked fine. \r\n\r\nThis is happening only in my application. But using the fix as suggested by me , it works fine.\r\n\r\nOne more issue identified in codeplex release and my release (both) is : typing the date is not accepted (it allows to types) , it replaces with the bound date once you press enter or leave focus. It only allows use of calender to select date.\r\n\r\nI'm trying to fix this issue now and will let you know if this issue needs withdrawn in 2 days.\r\n\r\nThanks, \r\nJitendra\r\n\r\n",
      "PostedDate": "2009-03-17T03:31:24.017-07:00",
      "Id": -2147483648
    },
    {
      "Message": "Can you clarify what you mean by: \" typing the date is not accepted (it allows to types) , it replaces with the bound date once you press enter or leave focus. It only allows use of calender to select date.\" ?  Correct me if I am wrong, but the behavior you are experiencing shows that the Binding is erased when using the TextBox but works when using the PopUp Calendar?  I am using a DatePicker with a SelectedDate Bound (TwoWay) to a seperate Calendar's SelectedDate. Changing the SelectedDate via the TextBox or the Popup Calendar on the DatePicker both work fine, the Binding is kept, and it behaves as expected. Is this not the case with your code?\r\n\r\n-Eric, MSFT",
      "PostedDate": "2009-03-19T11:46:10.21-07:00",
      "Id": -2147483648
    },
    {
      "Message": "Eric,\r\n\r\nThe issue was there before I updated to the latest version of March 2009. In my code, there is not code to enhance/edit/change DatePicker. But the issue was as follows. (In bound DatePicker in Data Form and Unbound DatePicker in Query Form)\r\n\r\nDatePicker was only showing selected date, selected using calendar.\r\nDatePicker was replacing the date typed in datepicker with the ealier one. (it may be the load time set date or the selected date via calendar.)\r\n\r\nThis behaviour was in ealier version and was only happening while in my application. Strange...but was an pending issue...\r\n\r\nThanks for the updated version very soon. You can close this issue for now.\r\n",
      "PostedDate": "2009-03-24T10:27:46.24-07:00",
      "Id": -2147483648
    },
    {
      "Message": "",
      "PostedDate": "2009-03-24T12:38:48.09-07:00",
      "Id": -2147483648
    },
    {
      "Message": "",
      "PostedDate": "2013-02-21T18:41:29.33-08:00",
      "Id": -2147483648
    },
    {
      "Message": "",
      "PostedDate": "2013-05-16T05:31:09.713-07:00",
      "Id": -2147483648
    }
  ]
}