{
  "WorkItem": {
    "AffectedComponent": {
      "Name": "",
      "DisplayName": ""
    },
    "ClosedComment": "",
    "ClosedDate": null,
    "CommentCount": 0,
    "Custom": null,
    "Description": "We tracked down an issue related to the DataGrid that resulted in our application hanging and becoming utterly unresponsive. Here are the steps to reproduce:\n \n* Add a DataGrid to the main Window of your WPF application.\n* In App.xaml, add a Style without a key for the Button class. Add one Setter, which sets the Margin to 5.\n \nRun your application. You will see the main window open, but will hang. Comment out the style, and it will work fine.",
    "LastUpdatedDate": "2013-02-21T18:41:17.14-08:00",
    "PlannedForRelease": "",
    "ReleaseVisibleToPublic": false,
    "Priority": {
      "Name": "Low",
      "Severity": 50,
      "Id": 1
    },
    "ProjectName": "wpf",
    "ReportedDate": "2009-05-12T13:43:08.593-07:00",
    "Status": {
      "Name": "Active",
      "Id": 2
    },
    "ReasonClosed": {
      "Name": "Unassigned"
    },
    "Summary": "DataGrid hangs when non-keyed Styles used",
    "Type": {
      "Name": "Issue",
      "Id": 3
    },
    "VoteCount": 2,
    "Id": 9966
  },
  "FileAttachments": [],
  "Comments": [
    {
      "Message": "Hi,\r\n\r\nWe weren't able to recreate this problem using the following style:\r\n         <Style TargetType=\"Button\">\r\n             <Setter Property=\"Margin\" Value=\"5\"/>\r\n         </Style>\r\n\r\nIs there something else we should add?  Also, what OS and toolkit version are you using?  If you have a repro of the problem you could attach we will investigate that.\r\n\r\nThanks!\r\nAlexis",
      "PostedDate": "2009-05-26T13:34:26.633-07:00",
      "Id": -2147483648
    },
    {
      "Message": "I experienced this issue today as well. I had a working datagrid on my usercontrol, but when I added \r\n<Style TargetType=\"Button\">\r\n     <Setter Property=\"Margin\" Value=\"3\" />\r\n     <Setter Property=\"Padding\" Value=\"5\" />\r\n</Style>\r\n\r\nto my ResourceDictionary, Visual Studio froze ( I had the XAML designer open), and running the application itself resulted in a hang once I reached the screen the usercontrol was on. There don't seem to be any exceptions being thrown. The only additional help I could maybe offer here is that a windbg session seemed to show it getting hung up while doing some sort of size calculations (presumably on the headers, I didn't have any data in the datagrid.) I'm no WPF expert but I am presuming something about setting the style on the Button type, and the fact the DataGrid appears to use buttons for the headers, and the interaction of those two factors is what is causing the problem.\r\n\r\nI'm using WPFToolkit 3.5.40320.1 on Vista 32bit SP1.",
      "PostedDate": "2009-06-17T14:30:04.793-07:00",
      "Id": -2147483648
    },
    {
      "Message": "This is a known issue. This happens because DataGrid's template has button (Select All button), which doesn't like Margin on it. Reason - such a margin would mess up with some computations and may result in infinite loop of computations. The fix would be not to use margin on all the buttons in a generic fashion. Also adding an implicit style for button in DataGrid.Resources which doesnt have margin would work.",
      "PostedDate": "2009-06-19T13:53:30.513-07:00",
      "Id": -2147483648
    },
    {
      "Message": "",
      "PostedDate": "2013-02-21T18:41:17.14-08:00",
      "Id": -2147483648
    }
  ]
}