{
  "WorkItem": {
    "AffectedComponent": {
      "Name": "",
      "DisplayName": ""
    },
    "ClosedComment": "",
    "ClosedDate": null,
    "CommentCount": 0,
    "Custom": null,
    "Description": "I get an exception when using a DataGrid bound to a collection with a validation rule, when the data source changes after the validation failed for a cell (and was not corrected).\n \nI'm including a small project to reproduce the problem. There is a ListBox (\"Level\" class item) to select which collection is bound to the DataGrid (\"Player\" class items):\n1) select the item \"First\" in the ListBox (done automatically when the application starts);\n2) modify the age of Teddy and put an incorrect value: \"x\" for example;\n3) type Enter to start the validation;\n \n-> this produces a red border in the DataGrid to signal the validation error: OK\n \n4) select the item \"Second\" in the ListBox;\n \n-> the values are correctly shown\n \n5) select the item \"First\" again, in the ListBox;\n \n-> the application crashes with the following message:\n \nSystem.InvalidOperationException was unhandled\n  Message='DeferRefresh' is not allowed during an AddNew or EditItem transaction.\n  Source=PresentationFramework\n \nThe whole trace can be seen here: http://pastebin.com/5GwK5W5q\n \nThe problem is probably due to the item being stuck in edit mode, it should be cancelled when the ItemsSource changes, or the developer should be able to call a function to cancel on the DataContextChanged event (or before) so that doesn't happen.\n \nA test calling CancelEdit() on the DataGrid when DataContextChanged is occurring (or before, when losing the focus of the TextBox) did not solve the problem.",
    "LastUpdatedDate": "2013-02-21T18:40:23.24-08:00",
    "PlannedForRelease": "",
    "ReleaseVisibleToPublic": false,
    "Priority": {
      "Name": "Low",
      "Severity": 50,
      "Id": 1
    },
    "ProjectName": "wpf",
    "ReportedDate": "2010-08-30T08:45:17.237-07:00",
    "Status": {
      "Name": "Proposed",
      "Id": 1
    },
    "ReasonClosed": {
      "Name": "Unassigned"
    },
    "Summary": "DataGrid exception on validation failure (DeferRefresh is not allowed...)",
    "Type": {
      "Name": "Issue",
      "Id": 3
    },
    "VoteCount": 1,
    "Id": 14147
  },
  "FileAttachments": [
    {
      "FileId": 4802,
      "FileName": "DataGrid.DeferRefresh.zip",
      "DownloadUrl": ".\\4802"
    }
  ],
  "Comments": []
}