{
  "WorkItem": {
    "AffectedComponent": {
      "Name": "",
      "DisplayName": ""
    },
    "ClosedComment": "",
    "ClosedDate": null,
    "CommentCount": 0,
    "Custom": null,
    "Description": "I spent the last hour trying to understand why my WPF plotting test would crash the Visual Studio Designer on my 64 bit machine. It turned out to be an IntPtr error due to a 32/64 bit assembly mismatch. I was able to solve the problem by running CorFlags.exe on all of the WPF Toolkit dlls and explicitly setting them to /32BIT+. I think this is all due to the fact that the binaries are built with \"Any CPU\". I suggest provide separate 32 bit and 64 bit binaries. Alternatively, if only 32 bit support was intended, then please change \"Any CPU\" to \"x86\" in the Build settings to avoid confusion.",
    "LastUpdatedDate": "2013-02-21T18:40:58.773-08:00",
    "PlannedForRelease": "",
    "ReleaseVisibleToPublic": false,
    "Priority": {
      "Name": "Low",
      "Severity": 50,
      "Id": 1
    },
    "ProjectName": "wpf",
    "ReportedDate": "2009-09-03T20:44:31.087-07:00",
    "Status": {
      "Name": "Proposed",
      "Id": 1
    },
    "ReasonClosed": {
      "Name": "Unassigned"
    },
    "Summary": "Provide separate 32 bit and 64 bit binaries, or change \"Any CPU\" to \"x86\" in Build settings to avoid confusion",
    "Type": {
      "Name": "Issue",
      "Id": 3
    },
    "VoteCount": 2,
    "Id": 10580
  },
  "FileAttachments": [],
  "Comments": [
    {
      "Message": "When I switch my solution's platform to x86 and attempt to build I get errors in any xaml code that utilizes the toolkit\r\n\r\nThe tag 'DatePicker' does not exist in XML namespace 'http://schemas.microsoft.com/wpf/2008/toolkit'. \r\n\r\nWhen I change the platform back to Any CPU it builds fine. The problem is I am using dlls that are 32-bit only, so I need to build my solution as x86 so that it will run on 64bit operating systems. That sounds counter intuitive, however, if your application is built for Any CPU and run on a 64bit OS it will run in 64bit and this will cause errors when it is trying to utilize 32bit dlls. Long story short I think we need the toolkit built for 64 and 32bit platforms, as well as Any CPU.",
      "PostedDate": "2010-07-08T05:05:02.38-07:00",
      "Id": -2147483648
    },
    {
      "Message": "",
      "PostedDate": "2013-02-21T18:40:58.773-08:00",
      "Id": -2147483648
    }
  ]
}