{
  "WorkItem": {
    "AffectedComponent": {
      "Name": "",
      "DisplayName": ""
    },
    "ClosedComment": "Thanks for the suggestion&#33;  We&#39;ve recorded this information in an internal database and will consider including these changes in a future release.",
    "ClosedDate": "2009-05-27T10:17:52.77-07:00",
    "CommentCount": 0,
    "Custom": null,
    "Description": "Short version: please add default easing to the automatically generated transitions between visual states.\n \nWhy?\n \n1. VSM is a fantastic way to help us efficiently build GUI with multiple visual states. One way to make us more productive is automatically taking care of all the \"dumb\" transitions. E.g. when I go from opacity 0.8 to 1.0; or when the width goes from 50 to 100; it's not really \"productive\" to spend time writing those straightforward Storyboards. Just let me specify the duration and go for it. And it's awesome that the VSM already has this feature but...\n \n2. ...it is useless right now, because the automatic transition doesn't use any easing function. There is no case where a transition is visually pleasing and feels \"smooth\" without easing. So right now I end up creating tons of boring storyboards, just to be able to insert some easing function into it. This is what makes an interface \"feel smooth\" so I really have to write all that stuff.\n \nThe solution is simple:\n- please add some default easing into the automatically generated transitions, so that I can be more productive;\n- even better: on top of that allow users to specify which easing function they want to use, the same way they can specify the duration (this may only be possible with the new easy-to-use easing properties in .NET 4.0 and Silverlight 3).",
    "LastUpdatedDate": "2013-05-16T05:31:06.75-07:00",
    "PlannedForRelease": "",
    "ReleaseVisibleToPublic": false,
    "Priority": {
      "Name": "Low",
      "Severity": 50,
      "Id": 1
    },
    "ProjectName": "wpf",
    "ReportedDate": "2009-05-13T12:29:55.823-07:00",
    "Status": {
      "Name": "Closed",
      "Id": 4
    },
    "ReasonClosed": {
      "Name": "Unassigned"
    },
    "Summary": "VSM Generated transitions are required but useless",
    "Type": {
      "Name": "Issue",
      "Id": 3
    },
    "VoteCount": 2,
    "Id": 9971
  },
  "FileAttachments": [],
  "Comments": [
    {
      "Message": "Thanks for the suggestion, we will look into this for a future release!",
      "PostedDate": "2009-05-26T13:42:20.1-07:00",
      "Id": -2147483648
    },
    {
      "Message": "",
      "PostedDate": "2009-05-27T10:17:52.77-07:00",
      "Id": -2147483648
    },
    {
      "Message": "",
      "PostedDate": "2013-02-21T18:41:16.987-08:00",
      "Id": -2147483648
    },
    {
      "Message": "",
      "PostedDate": "2013-05-16T05:31:06.75-07:00",
      "Id": -2147483648
    }
  ]
}